[{"word": "A Bad Haircut",
"description": "The perfect start to a bad hair day."},
{"word": "A Bull Fight",
"description": "Also known as \"la fiesta brava\" (the brave festival). A whole lot of bull.."},
{"word": "A Car Crash",
"description": "\"Hey, it was an accident!\""},
{"word": "A Cheap Motel",
"description": "No charge for the cockroaches."},
{"word": "A Crawl Space",
"description": "Where you'll find something the cat dragged in."},
{"word": "A Dozen Red Roses",
"description": "When eleven just won't do."},
{"word": "A Flat Tire",
"description": "\"Whaddya mean, there's no spare?\""},
{"word": "A Full Moon",
"description": "\"When the moon hits your eye like a big pizza pie, that's amore!\" -Dean Martin"},
{"word": "A Haunted House",
"description": "Maybe if people would STOP building their dream homes on ancient burial grounds ..."},
{"word": "A High School Bathroom",
"description": "\"Fools rush in where angels fear to tread\" -Alexander Pope"},
{"word": "A Honeymoon",
"description": "America's top honeymoon spots are Hawaii, Niagara Falls, Las Vegas and Florida. You can get there by air, land, sea ... or shotgun."},
{"word": "A Locker Room",
"description": "Steamy atmosphere ... bawdy humor ... sweaty bodies ... HEY! Sounds like Cable TV!"},
{"word": "A Morgue",
"description": "\"Given strange eons, even death may die...\" -H.P. Lovecraft"},
{"word": "A Nine Iron",
"description": "A golf club best used on short shots or large opponents."},
{"word": "A School Bus",
"description": "The only thing we have to fear is fear itself. -Franklin D. Roosevelt"},
{"word": "A School Cafeteria",
"description": "Food fight!."},
{"word": "A Sunrise",
"description": "\"But he who kisses the joy as it flies/ Lives in eternity's sunrise.\" -William Blake"},
{"word": "A Sunset",
"description": "The sun never set on the British Empire ... because God didn't trust the English in the dark."},
{"word": "A Tree House",
"description": "Your first high-rise apartment."},
{"word": "A Used Car Lot",
"description": "One of the most honest places around. Honest ..."},
{"word": "Abraham Lincoln",
"description": "1809-65, 16th U.S. president, led the Union to victory in the American Civil War and abolished slavery. Was assassinated for his efforts."},
{"word": "Adam Sandler",
"description": "1966- , American comedian, film star, and Saturday Night Live alumnus. Genius or goofball - you make the call."},
{"word": "Adolph Hitler",
"description": "1889-1945, turned Germany into a militarized dictatorship, caused the slaughter of millions and launched World War II."},
{"word": "AIDS",
"description": "Acquired Immune Deficiency Syndrome."},
{"word": "Airline Food",
"description": "Since when is a bag of peanuts considered a meal?"},
{"word": "Al Pacino",
"description": "1940- , Oscar winning American actor and star of \"The Godfather,\" \"Dog Day Afternoon\" and \"Scent Of A Woman.\" One very intense guy."},
{"word": "Albert Einstein",
"description": "1879-1955, German-born American physicist and Nobel laureate who created theories of relativity. Nice hair."},
{"word": "Alfred Hitchcock",
"description": "1899-1980, British-born American director and producer of brilliant psychological thrillers. Right, mother? MOTHER!"},
{"word": "Alien Abductions",
"description": "There was a blinding light -and she was gone!"},
{"word": "Americans",
"description": "How many Americans does it take to screw in a light bulb? THAT'S NOT FUNNY! WE'RE SUING!"},
{"word": "Amputations",
"description": "\"A SCRATCH? Your arm's off!\" -Monty Python and the Holy Grail."},
{"word": "Angry Hornets",
"description": "Who put the bees in their bonnets?."},
{"word": "Andy Warhol",
"description": "1928-87, American painter and filmmaker, a leader of the pop art movement. Famous for slightly more than 15 minutes."},
{"word": "Anne Frank",
"description": "1929-45, German Jewish girl who wrote in her diary about her family hiding from the Nazis. She died in a concentration camp."},
{"word": "Antarctica",
"description": "Home to the lowest temperature ever recorded on earth, -126.9 F."},
{"word": "Anthony Hopkins",
"description": "1937- , British actor starred in The Elephant Man, Howard's End, and, of course, The Silence Of The Lambs. Knighted in 1992."},
{"word": "Apple Pie",
"description": "It's as American as ... as ... something ..."},
{"word": "Apples",
"description": "More than 40 million metric tons are produced worldwide every year. How 'bout them apples?"},
{"word": "Armed Robbery",
"description": "You got your Robbery, your Armed Robbery, your Strong Armed Robbery, and, of course, the five finger discount."},
{"word": "Assembly Lines",
"description": "Faster. FASTER!"},
{"word": "At My Parent's House",
"description": "Like never-never land, you're never seen as an adult here."},
{"word": "Atlantis",
"description": "Mythological city where the folks had that sinking feeling."},
{"word": "Atomic Bombs",
"description": "The Italian physicist Enrico Fermi succeeded in producing the first nuclear chain reaction in 1942, at the University of Chicago."},
{"word": "Attack On Pearl Harbor",
"description": "\"Yesterday, December 7th, 1941, a date which will live in infamy ...\" -Franklin D. Roosevelt"},
{"word": "Austin Powers",
"description": "Fictional British man of mystery. Yeah, bay-beee, yeah!"},
{"word": "Australian Outback",
"description": "Beware of dangerous temperatures, strange animals, and didgeridoos."},
{"word": "Babe Ruth",
"description": "1895-1948, American baseball legend, and one heck of a candy bar!"},
{"word": "Babies",
"description": "Little bundles of joy ... and who needs sleep, anyway?"},
{"word": "Baby Showers",
"description": "Baby showers may bring flowers ..."},
{"word": "Backstreet Boys",
"description": "The latest American pop boy band. Which one do you think is the cutest?"},
{"word": "Bad Dogs",
"description": "Bad dog, bad dog. What'cha gonna do?"},
{"word": "Bagpipes",
"description": "A shrill-toned musical instrument consisting of a leather bag and pipes. Also available in plaid."},
{"word": "Baked Beans",
"description": "Add a little bacon, brown sugar and Beano!"},
{"word": "Baked Potatoes",
"description": "Hot potato, couch potato, potato head, twice baked, half-baked, ... whatever."},
{"word": "Baking Cookies",
"description": "An experience only surpassed by eating them."},
{"word": "Bald Eagles",
"description": "Known for their majestic appearance and powerful flight. In 1782, the bald eagle was chosen as the emblem of the United States."},
{"word": "Ballerinas",
"description": "Beautiful, graceful dancers who are always on their toes."},
{"word": "Bangkok",
"description": "Capital of Thailand. Location: near the Gulf of Siam. Population: five million. Reputation: seedy."},
{"word": "Bankruptcy",
"description": "It'll be the debt of you."},
{"word": "Barbara Walters",
"description": "1931- , American television journalist and author. Voted one of the most important women of the century by \"Ladies Home Journal.\""},
{"word": "Barbed Wire",
"description": "Wire with sharp points, used for fences. Created havoc on the western frontier."},
{"word": "Barfing",
"description": "We didn't want to bring that up ..."},
{"word": "Barney",
"description": "Purple dinosaur. \"I love you, you love me, blah, blah, blah ... \""},
{"word": "Bart Simpson",
"description": "Fictional animated character. Don't have a cow, man!\""},
{"word": "Bates Motel",
"description": "The haunt of Alfred Hitchcock's psycho, Norman Bates ... and mother, of course ..."},
{"word": "Batman",
"description": "How does Batman's mother call him home? \"Dinner, dinner, dinner, dinner, dinner, dinner, dinner, dinner - BATMAN!\""},
{"word": "Bats",
"description": "The little brown bat consumes as many as 600 mosquitoes in an hour. The vampire bat dines elsewhere ..."},
{"word": "Beach Parties",
"description": "Up for some \"Beach Blanket Bingo,\" Annette?"},
{"word": "Beanie Babies",
"description": "Tiny plush collectibles to love and cherish. Don't take that tag off!"},
{"word": "Beauty And The Beast",
"description": "A tale as old as time ... so Disney didn't have to pay royalties."},
{"word": "Beer",
"description": "\"Beer is proof that God loves us and wants us to be happy.\" -Benjamin Franklin"},
{"word": "Beer Bellies",
"description": "Just think of them as microbreweries."},
{"word": "Beethoven",
"description": "1770-1827, German composer, considered one of the greatest of the western world."},
{"word": "Beets",
"description": "Beats Brussels sprout."},
{"word": "Being In Love",
"description": "\"Love's like the measles, all the worse when it comes late.\" -Douglas Jerrold"},
{"word": "Bell-Bottoms",
"description": "Bell-bottoms and pea coats -who would have thought the Navy could be such a trendsetter?"},
{"word": "Ben Stiller",
"description": "1965-, American actor, director, and funny guy of Reality Bites, There's Something About Mary, and Meet The Parents"},
{"word": "Berlin",
"description": "1945- Adolph Hitler's last stand. Bunker ... I mean -hunker down, soldier."},
{"word": "Big Bang Theory",
"description": "A cosmological theory for the origin of the universe. An explosive idea!"},
{"word": "Big Macs",
"description": "T w o a l l b e e f p a t t i e s s p e c i a l s a u c e l e t t u c e c h e e s e p i c k l e s o n i o n s o n a s e s a m e s e e d b u n ."},
{"word": "Bigfoot",
"description": "Legendary North American monster, a.k.a. Sasquatch or the Abominable Snowman."},
{"word": "Bill Clinton",
"description": "1946- , popular, yet embattled, 42nd president of the United States."},
{"word": "Bill Gates",
"description": "1955-, chairman and chief software architect of Microsoft Corporation. A very rich guy."},
{"word": "Bill Murray",
"description": "1950-, American actor and comedian. Star of Ghostbusters, Stripes, Groundhog Day, and Lost In Translation."},
{"word": "Billboards",
"description": "Only 1,254 miles to Wall Drug ..."},
{"word": "Bingo",
"description": "\"There was a farmer, had a dog, and Bingo was his name-o ...\""},
{"word": "Bird Watching",
"description": "A hobby that relies on a wing and a prayer."},
{"word": "Black Holes",
"description": "The gravitational field of a black hole is so strong that nothing, including light, can escape from its vicinity."},
{"word": "Black Velvet",
"description": "Smooth, silky and sophisticated ... until you paint an Elvis on it."},
{"word": "Blizzard",
"description": "Extreme cold, strong winds, and a head snowfall. Also known as Canada."},
{"word": "Blood",
"description": "A healthy human body contains between five and six quarts of blood. Bloody right they do!"},
{"word": "Board Games",
"description": "Games have been played for thousands of years. Some games of Monopoly just SEEM that long."},
{"word": "Body Odor",
"description": "Over $1.6 billion is spent each year on antiperspirants in the United States. That stinks!"},
{"word": "Body Piercing",
"description": "YOU STUCK WHAT? WHERE?"},
{"word": "Body Surfing",
"description": "When you're too cheap to buy a surfboard."},
{"word": "Bonbons",
"description": "Sweets for the sweet ..."},
{"word": "Bongos",
"description": "Small drums played with the fingers. Used in Latin American and African music. The choice of American beat poets."},
{"word": "Bottled Water",
"description": "How much are you willing to pay for something you can get for free?"},
{"word": "Boxing",
"description": "An ancient and honorable sport -- not just for boys anymore ..."},
{"word": "Boy Scouts",
"description": "International organization for boys and young men founded in England in 1908, to foster character, citizenship and outdoor life."},
{"word": "Boyfriends",
"description": "\"My boyfriend's back and you're gonna be in trouble.\" - The Angels"},
{"word": "Brad Pitt",
"description": "1963- , American actor and heart-throb."},
{"word": "Brain Surgeons",
"description": "Hey, it ain't brain surgery ... oh ... wait a second ..."},
{"word": "Brains",
"description": "Vital to human existence and mad scientists."},
{"word": "Britney Spears",
"description": "1981-, American singer. From mouseketeer to international pop star."},
{"word": "Broadway",
"description": "The New York theater district. \"They say the neon lights shine bright on Broadway.\" -Barry Mann"},
{"word": "Bruce Willis",
"description": "1955- , Diehard American action movie star who has moonlighted on TV. He also starred in Pulp Fiction, Armageddon and The Sixth Sense."},
{"word": "Bubble Gum",
"description": "Crack it, snap it, pop it, and blow it!"},
{"word": "Bubbles",
"description": "\"Tiny bubbles, in the wine/ Tiny bubble make me feel fine ...\" -Don Ho"},
{"word": "Bullwinkle",
"description": "As in the cartoon \"The Adventures of Rocky and Bullwinkle\" -- the moose half of moose and squirrel."},
{"word": "Bumper Stickers",
"description": "Your personal billboard!"},
{"word": "Bungee Jumping",
"description": "Another sport hanging on by a thread."},
{"word": "Buying A House",
"description": "If only we had the money, we could get a mortgage."},
{"word": "Cabbage",
"description": "From the French word caboche, meaning \"big head.\""},
{"word": "Cactus",
"description": "Require little care and exhibit bizarre forms. As such, they are often mistaken for Survivalists."},
{"word": "California",
"description": "Sacramento is its capital, Los Angeles its largest city. Here we come."},
{"word": "Camping Trip",
"description": "When you just have to get s'more nature."},
{"word": "Canada",
"description": "Federated country of North America. The Great White North - eh?"},
{"word": "Canadians",
"description": "How many Canadians does it take to screw in a lightbulb? Fifteen. Fourteen to chip it out of the ice, and one to screw it in."},
{"word": "Captain Kirk",
"description": "Fictional starship captain. \"Beam me up Scotty, there is no intelligent life on this planet!\" - bumper sticker, 1980s"},
{"word": "Car Bombs",
"description": "Not including the Ford Pinto, of course."},
{"word": "Car Horns",
"description": "Blow it, buddy!"},
{"word": "Carl Sagan",
"description": "1934-96, American astronomer and pioneer exobiologist. Touched many lives. Billions and billions of them."},
{"word": "Carnival Workers",
"description": "Step right up ..."},
{"word": "Cary Grant",
"description": "1904-86, British-born American actor known for his debonair manner. He can be found North by Northwest."},
{"word": "Casablanca",
"description": "The largest city in Morocco, and one heck of a good movie. \"Of all the gin joints in all the towns in all the world...\""},
{"word": "Casinos",
"description": "Slots and slots of fun."},
{"word": "Castles",
"description": "Kings, queens, knights in shining armor, and little square hamburgers."},
{"word": "Caves",
"description": "Stalactites, stalagmites. Which go up and which go down?"},
{"word": "Celine Dion",
"description": "1968-, Canadian singer whose heart will go on, and on ..."},
{"word": "Cell Phones",
"description": "Get off the phone or get off the road!"},
{"word": "Cesar Chavez",
"description": "1927-93, American labor leader who led the 1965 nationwide boycott of California grapes ... a bunch of sour grapes!"},
{"word": "Chain Letters",
"description": "Send this game to ten of your friends and good luck will follow. Honest!"},
{"word": "Chains",
"description": "Gold or iron: name your shackles."},
{"word": "Challenger Explosion",
"description": "\"Without a wish, without a will/ I stood upon that silent hill/ and stared into the sky ...\" -Ralph Hodgeson"},
{"word": "Chameleons",
"description": "The chameleon is a lizard that changes color when frightened -or is that a politician?"},
{"word": "Charging Rhinos",
"description": "How do you stop a rhino from charging? Take away its credit cards."},
{"word": "Cheesecake",
"description": "A really tasty dish."},
{"word": "Cher",
"description": "1946- , American singer and actor, she makes aging look good."},
{"word": "Chicago",
"description": "Third largest city in the United States. Our kind of town."},
{"word": "Chicken Pox",
"description": "Infectious disease usually contracted in childhood. Just don't scratch 'em!"},
{"word": "Chickens",
"description": "From incubator to rotisserie in 56 days! Run, chicken, run!"},
{"word": "Chimpanzees",
"description": "Sure, they're related to us; but they don't write, and they NEVER call!"},
{"word": "China",
"description": "The most populous country in the world. More than one-fifth of the world's total population lives within its borders."},
{"word": "Chinatown",
"description": "International travel, just around the corner."},
{"word": "Choir Boys",
"description": "They sound angelic, but ..."},
{"word": "Chorus Girls",
"description": "Long legs and high kicks!"},
{"word": "Cigarette Burns",
"description": "Another reason to give up smoking."},
{"word": "Cigarettes",
"description": "Mind if I smoke?"},
{"word": "Cinco de Mayo",
"description": "Marks the victory of the Mexican Army over the French at the Battle of Puebla, in 1862."},
{"word": "Cindy Crawford",
"description": "1966- , American Supermodel. What dreams are made of."},
{"word": "Clark Gable",
"description": "1901-60, American film actor, noted as a romantic lead. Frankly, my dear, he didn't give a damn."},
{"word": "Claude Monet",
"description": "1840-1926, French painter, regarded as one of the leaders on the impressionist movement."},
{"word": "Cleaning The Bathroom",
"description": "It's YOUR turn!"},
{"word": "Cleopatra",
"description": "c. 69-30 BC, Queen of Egypt, noted for love affairs with Julius Caesar and Mark Antony, which came back to bite her in the asp."},
{"word": "Clint Eastwood",
"description": "1930-, American film actor and director, past mayor of Carmel, California. Has earned fistfuls of dollars."},
{"word": "Clowns",
"description": "They would be really funny if they weren't so darn scary."},
{"word": "Cocaine",
"description": "Alkaloid obtained from leaves of the coca plant and used as a local anesthetic and abused as a drug."},
{"word": "Cockroaches",
"description": "Annoying insects that can survive a nuclear war. Fortunately, they can't survive the heel of your shoe."},
{"word": "Coconuts",
"description": "\"Put the lime in the coconut, and drank them both up.\" -Harry Nillson"},
{"word": "Cold Pizza",
"description": "The breakfast of champions."},
{"word": "Communists",
"description": "\"From each, according to their ability, to each according to their need.\" I need a new Ferrari."},
{"word": "Commuting",
"description": "The daily grind. And we're not talking coffee."},
{"word": "Computer Hackers",
"description": "We didn't mean to shut down the entire government ..."},
{"word": "Computers",
"description": "British mathematician Charles Babbage worked out the principles of the modern digital computer in the late 1800s."},
{"word": "Confucius",
"description": "c. 551-479 BC, K'ung Fu-Tzu, Chinese philosopher and one of the most influential figures in Chinese history."},
{"word": "Conspiracy Theories",
"description": "Oh, that was just a coincidence!"},
{"word": "Construction Workers",
"description": "Hard hats -hard bodies."},
{"word": "Corn On The Cob",
"description": "A grain native to the Americas, corn was a staple food for many centuries before corn holders were invented."},
{"word": "Corvettes",
"description": "In 1953, Chevrolet introduced the Corverre, the first mass-produced sports car with a fiberglass body. The perfect cure for a midlife crisis."},
{"word": "Count Dracula",
"description": "\"I vant to suck your blood!\""},
{"word": "Country Music",
"description": "Encompassing styles such as western swing, honky-tonk, bluegrass and rockabilly. Should mention a pickup truck and a dog named \"Bo.\""},
{"word": "Cow-Pies",
"description": "When dried, these \"cow chips\" are hurled discus-like over great distances. It's true."},
{"word": "Crazy Horse",
"description": "1849?-77, chief of the Oglala Sioux. A leader in the Native American resistance to the westward expansion on the United States."},
{"word": "Creamed Corn",
"description": "Eat it, it's good for you."},
{"word": "Crystal Balls",
"description": "I see a Green Apple card in your future."},
{"word": "Cuba",
"description": "Island republic in the Caribbean, just south of Florida. Beans and rice never tasted so good."},
{"word": "Cults",
"description": "They seemed nice ..."},
{"word": "Custer's Last Stand",
"description": "1866, Little Big Horn. Very big mistake."},
{"word": "Dandruff",
"description": "Dry skin on your scalp? Sounds a bit flaky."},
{"word": "Danielle Steel",
"description": "1947- , Prolific romance novelist. \"Suddenly, Stephanie spotted Lance on the beach ...\""},
{"word": "Danny DeVito",
"description": "1944- , American television, motion-picture actor, and director. Star of Taxi, Romancing The Stone, Twins, and Get Shorty."},
{"word": "Dark Alleys",
"description": "Don't go there!"},
{"word": "Darth Vader",
"description": "\"Luke ... (wheeze) .. I am ... (wheeze) ... your father ... and you don't write, you don't call ... NOTHING.\""},
{"word": "Dating",
"description": "First stage of the human mating ritual."},
{"word": "David Letterman",
"description": "1947- , American television entertainer and talk-show host. And ... the Number One reason to watch him (drum roll, please): TOP TEN LISTS!"},
{"word": "Daytime TV",
"description": "Soap operas, game shows, talk shows and reruns ... is this a great country or what?"},
{"word": "Death Valley",
"description": "Arid, desolate and hellish region of California. Named by a survivor of an attempted 1849 crossing."},
{"word": "Deer Hunting",
"description": "Nooo! Nooooo! Not BAMBI'S MOTHER!"},
{"word": "Demi Moore",
"description": "1962-, American actor in St. Elmo's Fire, Ghost and GI Jane."},
{"word": "Democrats",
"description": "Their symbol is the donkey, or ass. Insert your own joke here."},
{"word": "Denzel Washington",
"description": "1954- , American actor known for his powerful roles in such movies as Cry Freedom, Malcolm X, and Mississippi Masala."},
{"word": "Detroit",
"description": "The Motor City is the world's foremost automobile manufacturing center, and the tenth largest city in the U.S."},
{"word": "Diamonds",
"description": "The hard fact: they are just highly refractive crystalline allotropes."},
{"word": "Discos",
"description": "Where you go to catch \"Saturday Night Fever.\""},
{"word": "Discovering America",
"description": "1492, Christopher Columbus discovered that America was discovered centuries before he arrived."},
{"word": "Disneyland",
"description": "You've just won the \"Apples to Apples(R) Grand Masters Tournament.\" Where're you gonna go?"},
{"word": "Divorce",
"description": "It's a trial separation that goes to trial."},
{"word": "Doctors",
"description": "Over twenty years of education and they're still \"practicing\" medicine?"},
{"word": "Doing The Dishes",
"description": "You wash, I'll watch."},
{"word": "Dolly Parton",
"description": "1967- , American singer, songwriter, and actor. Known as much for her personal style as for her successful career."},
{"word": "Dr. Kevorkin",
"description": "1928- , Controversial advocate of doctor-assisted suicide."},
{"word": "Dr. Seuss",
"description": "1904-1991, Theodor Suess Geisel , the cat who came up with \"The Cat in the Hat.\""},
{"word": "Driving Off A Cliff",
"description": "It was either that or hire someone to do my takes."},
{"word": "Duct Tape",
"description": "All-purpose, ... all the time ..."},
{"word": "E-Mail",
"description": "You've got JUNK mail!"},
{"word": "Ear Wax",
"description": "A waxy, yellowish substance that protects the ear from dust, bacteria, and from hearing things you don't want to hear."},
{"word": "Earthquakes",
"description": "The Richter scale is named after the American seismologist Charles Richter. Did the earth move for you?"},
{"word": "Earwigs",
"description": "Nocturnal insects with abdominal pincers. Nothing to do with ears or wigs."},
{"word": "East Coast",
"description": "From New England to Florida. They're not like folks 'round here ..."},
{"word": "Eddie Murphy",
"description": "1961-, American comedian, actor, and producer. Best known for his work in 48 Hours, Beverly Hills Cop and on Saturday Night Live."},
{"word": "Eleanor Roosevelt",
"description": "1884-1962, first lady, social activist, author, lecturer, and U.S. representative to the United Nations."},
{"word": "Electric Eels",
"description": "Slippery and slimy snakelike fishes that emit electrical charges. The shocking truth!"},
{"word": "Electricity",
"description": "The repulsive or attractive force between two stationary bodies. No problem unless one of those bodies is yours."},
{"word": "Elephants",
"description": "The largest living land mammal, with two species: Indian and African. Not counting Dumbo, there are no American elephants."},
{"word": "Elizabeth Taylor",
"description": "1932- , American actor, noted for her lush beauty, emotional performances and multiple husbands."},
{"word": "Elvis Presley",
"description": "1935-77, American singer and actor and the king of rock-and-roll. His death left the music world all shook up."},
{"word": "Emily Dickinson",
"description": "1830-86, American poet, whose lyrics are psychologically astute treatments of love, death, and immortality. So there."},
{"word": "Ernest Hemingway",
"description": "1899-1961, American novelist and short-story writer, whose macho style is crisp, laconic and understated."},
{"word": "Europe",
"description": "The Old Country ... except to people who live there."},
{"word": "Exorcism",
"description": "To ceremoniously expel an evil spirit."},
{"word": "Eyes",
"description": "Light-sensitive organ of vision in animals. See?"},
{"word": "Falling Down",
"description": "\"What we call failure is not the falling down, but the staying down.\" -Mary Pickford"},
{"word": "Family Reunions",
"description": "Just to remind you why you moved away in the first place ..."},
{"word": "Family Vacations",
"description": "Dad? Dad? Are we there yet? Are we there yet? Are we? Huh? Dad?"},
{"word": "Family Values",
"description": "Often said but seldom understood."},
{"word": "Fast Food",
"description": "You want fries with that?"},
{"word": "Feathers",
"description": "Which weighs more, a pound of feathers or a pound of rocks?"},
{"word": "Feminists",
"description": "Political and social activists who support selected women's causes."},
{"word": "Festering Wounds",
"description": "Quit picking at that!"},
{"word": "Fidel Castro",
"description": "1927-, Cuban revolutionary and Communist dictator since 1976. He earned a PhD in law in 1950."},
{"word": "Firefighters",
"description": "Emperor Augustus instituted a corps of fire-fighting \"watchmen\" in 24 B.C. Nero, on the other hand, fiddled while Rome burned."},
{"word": "Firestorms",
"description": "Some severe wildfires require more than 10,000 firefighters. And, wouldn't ya know it, some idiot parked in front of the hydrant!"},
{"word": "Fireworks",
"description": "Includes firecrackers, Roman candles, and bottle rockets. It's all fun until someone loses an eye ... and a nose ... and an arm ..."},
{"word": "First Man On The Moon",
"description": "July 20, 1969. \"That's one small step for a man, one giant leap for mankind.\" -Neil A. Armstrong"},
{"word": "Flipper",
"description": "American television dolphin of the 1960's ... like Lassie, only wetter."},
{"word": "Fly Fishing",
"description": "... if you can\"t catch flies any OTHER way ..."},
{"word": "Flying Monkeys",
"description": "The reason why \"The Wizard Of Oz\" still gives us nightmares."},
{"word": "Forest Fires",
"description": "\"Only YOU can prevent forest fires.\" The heat is on!"},
{"word": "Fort Knox",
"description": "American military post in Kentucky, containing the greater part of the gold reserve of the U.S. government."},
{"word": "Fourth Of July",
"description": "\"Independence Day\" in the United States. \"Thank Goodness We Got Rid of Them Day\" in Britain."},
{"word": "Frank Lloyd Wright",
"description": "1867-1959, pioneering American architect. Considered one of the greatest designers of the 20th century."},
{"word": "Frank Sinatra",
"description": "1915-98, the greatest American pop singer of his generation, award winning film and television actor. Do-be do-be do, baby."},
{"word": "Freckles",
"description": "No matter what they tell you, freckles won't grow together to form a great-looking tan."},
{"word": "Freedom",
"description": "Express yourself!"},
{"word": "French Wines",
"description": "The perfect complement to an overpriced meal."},
{"word": "Fresh Water Pearls",
"description": "String them along ..."},
{"word": "Friction",
"description": "Resistance to the motion of a body in contact with another body ... any body will do."},
{"word": "Fund Raising",
"description": "Hello ... my name is Jonathan, would you like to buy some fruit, magazines, candy bars, wreaths, pizzas ... ?"},
{"word": "Funerals",
"description": "\"He who dies with the most toys is, nonetheless, still dead.\" - Anonymous"},
{"word": "Fur",
"description": "The characteristic covering of mammals and people with money."},
{"word": "Fuzz",
"description": "Lint ... Policemen ... Whatever ..."},
{"word": "Gall Bladder",
"description": "Where excess bile is stored. Stored for what, we don't know."},
{"word": "Gang Members",
"description": "\"When you're a Jet, you're a Jet all the way...\" -West Side Story"},
{"word": "Garrison Keillor",
"description": "1942- , American author and radio star. He shares the Midwest perspective with 2.6 million listeners each week on A Prairie Home Companion."},
{"word": "Garth Brooks",
"description": "1962- , American country music singer and songwriter. He's got friends in low places."},
{"word": "Geishas",
"description": "Japanese women training in traditional singing, dancing, and entertaining. Of course, you would never recognize them without all that make-up."},
{"word": "Gen. George S. Patton",
"description": "1885-1945, the commander of the American Third Army during World War II. -a.k.a. Olf Blood and Guts"},
{"word": "Genetic Engineering",
"description": "What DO you get when you cross a monkey with a potato?"},
{"word": "George W. Bush",
"description": "1946- , 43rd president of the United States. The second time ever that the son of a former president was elected to the office."},
{"word": "George Washington",
"description": "1732-99, First President of the United States. He chopped down a cherry tree to make false teeth, or something like that ..."},
{"word": "Georgia O'Keeffe",
"description": "1887-1986, American abstract painter known for her still life compositions. Her skull paintings prove that beauty is more than skin deep."},
{"word": "Getting A Hug",
"description": "Hmmmm ... nice."},
{"word": "Ghost Towns",
"description": "Population unknown."},
{"word": "Ghosts",
"description": "Nonmaterial embodiments or the essence of organisms (mostly human beings). Quite spirited"},
{"word": "Giant Squid",
"description": "Going fishing for giant squid? Nautilus I have to ..."},
{"word": "Gila Monsters",
"description": "The largest, and only poisonous lizard found in the United States."},
{"word": "Gingko Trees",
"description": "An Asiatic tree, Gingko biloba, known for its fan shaped leaves. We can't remember what it's good for."},
{"word": "Ginseng",
"description": "Common name for plants of the ginseng family, source of a stimulant and a supposed aphrodisiac."},
{"word": "Girl Scouts",
"description": "I'll take six boxes of Thin Mints and three of the ... you know, the kind with the peanut butter."},
{"word": "Girlfriends",
"description": "Girlfriend - let's talk!"},
{"word": "Giving A Hug",
"description": "\"One may give without loving; but none can love without giving.\" -Anonymous"},
{"word": "Glaciers",
"description": "It'll be a cold day when we see THEM again ..."},
{"word": "Glazed Donuts",
"description": "If you're going to be late, take a box of donuts."},
{"word": "Global Warming",
"description": "Is it hot in here, or is it just me?"},
{"word": "Going To Church",
"description": "Weddings, funerals, bazaars, and bingo!"},
{"word": "Going To Grandma's",
"description": "\"Grandmother, what big teeth you have!\" -Little Red Riding Hood"},
{"word": "Going To School",
"description": "Secondary education? It's elementary."},
{"word": "Going To The Dentist",
"description": "This won't hurt a bit ..."},
{"word": "Going To The Gym",
"description": "No pain, no gain."},
{"word": "Gold Chains",
"description": "The more, the better."},
{"word": "Goldfish",
"description": "The pet, the carnival prize, or the snack cracker."},
{"word": "Golf-Ball-Sized Hail",
"description": "... which is almost as impressive as hail-sized golf balls ..."},
{"word": "Grace Kelly",
"description": "1929-82, Princess of Monaco and American film star of Dial M for Murder, Rear Window, and To Catch a Thief. Always chic, always elegant."},
{"word": "Graffiti",
"description": "Art in a can. We\"re drawn to it."},
{"word": "Grass Skirts",
"description": "Hula loves you, baby?"},
{"word": "Grave Robbers",
"description": "Famous for their bodies of work."},
{"word": "Gravity",
"description": "In 1684, the law of gravitation was formulated by English physicist Sir Isaac Newton, who recognized the gravity of the situation."},
{"word": "Greenpeace",
"description": "International organization dedicated to preserving the Earth's natural resources, and its diverse plant and animal life."},
{"word": "Gym Teachers",
"description": "\"I am a Physical Education Teacher. Call me a gym teacher again and you can drop and give me ten!\""},
{"word": "Hair Transplants",
"description": "Oh, it looks so natural ..."},
{"word": "Hairballs",
"description": "Cough it up, kitty ..."},
{"word": "Halloween",
"description": "October 31, the eve of All Saints' Day, celebrated with costumes, treats, and scary stuff. Not just for kids any more!"},
{"word": "Hand Grenades",
"description": "Close only counts in horseshoes and hand grenades!"},
{"word": "Handcuffs",
"description": "\"You have the right to remain silent...\""},
{"word": "Handguns",
"description": "Source of a never-ending controversy as to how to get them out of the hands of the bad guys and into the hands of the good guys."},
{"word": "Hangnails",
"description": "We've fingered the cause of the pain."},
{"word": "Having A Baby",
"description": "\"Rock-a-bye baby, on the tree top ...\" Who would put a kid on a tree top?"},
{"word": "Having An Operation",
"description": "What a cutup! A real stitch."},
{"word": "Hawaii",
"description": "The eight islands that make up America's 50th state entered the Union on August 21, 1959."},
{"word": "Helen Keller",
"description": "1880-1968, American author and lecturer who overcame deafness and blindness with the help of her companion, Anne Sullivan."},
{"word": "Hiccups",
"description": "How do you, hic, get em? How do you, hic, get rid of \"em?"},
{"word": "High School Football",
"description": "The whole ten yards!"},
{"word": "High School Reunions",
"description": "See also: \"root canal, as fun as ...\""},
{"word": "Hillary Rodham Clinton",
"description": "1947- , New York Senator, lawyer, and former American First Lady."},
{"word": "Hiroshima",
"description": "1945 - \"I am become death, the destroyer of worlds\" - J. Robert Oppenheimer, on the detonation of the first atmoic bomb."},
{"word": "HMOs",
"description": "Heath Maintenance Organizations. Here's to your health ..."},
{"word": "Hockey",
"description": "Did you hear about the big fight last night? All of a sudden, a hockey game broke out!"},
{"word": "Hollywood",
"description": "Motion picture and television industry center of the world. Hooray for Hollywood!"},
{"word": "Homeless Shelters",
"description": "In the United States, nearly three-quarters of the help for the homeless comes from the private sector, mostly from church soup kitchens."},
{"word": "Homer Simpson",
"description": "Fictional cartoon character created by Matt Groening. D'oh!"},
{"word": "Homework",
"description": "Something to do during comercials."},
{"word": "Hooligans",
"description": "\"Hey! Kids! Get outta my yard!\""},
{"word": "Horseback Riding",
"description": "WHOAAA!!!"},
{"word": "Hot Lava",
"description": "There's no better way to serve it."},
{"word": "House Guests",
"description": "How many visitors does it take to drive you crazy? Go on -take a guest!"},
{"word": "Hummingbirds",
"description": "Why do hummingbirds hum? Because they don't know the words ... ... da-dum, dum!"},
{"word": "Humphrey Bogart",
"description": "1899-1957, American film actor, starred in such classics as The Maltese Falcon and Casablanca. \"Here's looking at you kid.\""},
{"word": "Icebergs",
"description": "May reach 300 to 500 feet above the oceans's surface. Ask the captain of the Titanic about the 90 percent that's UNDER water."},
{"word": "In A Coma",
"description": "A deep, prolonged state of unconsciousness ... sometimes you just feel that way."},
{"word": "Incense",
"description": "Incense is better than no sense at all."},
{"word": "India",
"description": "The world's seventh largest country by area, but the second most populous, with one billion people."},
{"word": "Indiana Jones",
"description": "Fictional archeologist and action hero. Proof that a good hat and a whip can take you a long way."},
{"word": "Industrial Revolution",
"description": "The first Industrial Revolution occurred in Great Britain at the end of the 1700s. The second came with the invention of the \"Clapper.\""},
{"word": "Infomercials",
"description": "One of these days, one of them may even say something informative."},
{"word": "Inside The Sun",
"description": "Consisting mostly of hydrogen, the temperature reaches almost 16,000,000 K (about 29,000,000 F)."},
{"word": "Intellectuals",
"description": "They think they're so smart."},
{"word": "Ireland",
"description": "Island of the British Isles, west of Great Britain. Known for its distinctive traditional dance and music."},
{"word": "Israel",
"description": "Located on the Mediterranean, the state of Israel was reated by a 1948 U.N. mandate."},
{"word": "Italy",
"description": "European Republic, shaped like a boot - a very fashionable boot."},
{"word": "Jack Nicholson",
"description": "1937- , American motion-picture actor of \"Chinatown,\" \"Terms Of Endearment\" and \"The Shining.\" He's as good as it gets!"},
{"word": "Jack The Ripper",
"description": "Accused of murdering six women in 1888, and suspected in other murders. Still at large."},
{"word": "Jackie Chan",
"description": "1954-, actor, director, martial artist. Screen name, Sing Lung, means \"Becoming the Dragon.\" That's \"MISTER Becoming the Dragon\" to you!"},
{"word": "Jacques Cousteau",
"description": "1910-97, French naval officer, marine explorer, and author. Best known as a documentary filmmaker."},
{"word": "Jamaica",
"description": "Third largest island of the Greater Antilles, south of Cuba. Tropical climate, reggae music, and jerk cooking."},
{"word": "James Bond",
"description": "Fictional British secret agent created by English author Ian Fleming. Shaken, but never stirred."},
{"word": "James Dean",
"description": "1931-55, American actor of film, stage, and television. His role in Rebel Without a Cause helped define \"cool.\""},
{"word": "Japan",
"description": "An Asian constitutional monarchy. The capital city is Tokyo. Let's see ... sushi, Godzilla, earthquakes ..."},
{"word": "Japanese",
"description": "How many Japanese does it take to screw in a light bulb? Who needs light bulbs when you've got OUR new technology!"},
{"word": "Jelly Beans",
"description": "Well, as long as we HAVE to eat our vegetables ..."},
{"word": "Jennifer Lopez",
"description": "1970-, American singer and actor of Selena, Money Train, and Maid In Manhattan."},
{"word": "Jerry Springer",
"description": "1944- , controversial talk-show host. Don't those people know that millions of us are watching?"},
{"word": "Jesse Jackson",
"description": "1941-, American civil rights leader. Named to \"The Gallup List of Ten Most Respected by Americans\" for ten years."},
{"word": "Jesse Ventura",
"description": "1951-, wrestler, Navy Seal, and former governor of Minnesota. Author of I Ain't Got Time To Bleed."},
{"word": "Jim Carrey",
"description": "1962- , Canadian comedian and actor. Famous for outrageous faces, and dumb and dumber characters."},
{"word": "Jimmy Stewart",
"description": "1908-97, America's favorite self-image. Mr. Smith Goes to Washington, Rear Window, Vertigo, and It's a Wonderful Life, ... and it probably was."},
{"word": "Joan Of Arc",
"description": "1412-31, patron saint of France who decisively turned the tide of the Hundred Years' War, which really burned her up."},
{"word": "Jodie Foster",
"description": "1962- , American actor began her career on Mayberry, R.F.D. and went on to win Academy Awards for The Accused and Silence Of The Lambs."},
{"word": "John F. Kennedy",
"description": "1917-63, 35th president of the US. \"Ask not what your country can do for you; ask what you can do for your country.\""},
{"word": "John Glenn",
"description": "1921- , The first U.S. astronaut to orbit the earth in 1962, and a U.S. Senator. Never too old to shoot for the moon!"},
{"word": "John Philip Sousa",
"description": "1854-1932, American bandmaster and composer of Stars and Stripes Forever. Known as \"The March King.\""},
{"word": "John Travolta",
"description": "1954 - , American actor of \"Welcome Back, Kotter,\" \"Grease,\" \"Saturday Night Fever\" and \"Pulp Fiction.\" That man can dance!"},
{"word": "Judge Judy",
"description": "Ms. Sheindlin presides over real-life cases on this TV courtroom show. \"I'm the boss, applesauce!\""},
{"word": "Julia Roberts",
"description": "1967-, American actor and Pretty Woman. Also starred in Steel Magnolias, My Best Friend's Wedding, and Erin Brockovich."},
{"word": "Junk Mail",
"description": "Contests, credit card applications, solicitations and political ads."},
{"word": "Jupiter",
"description": "Story Problem: If one year on Jupiter equals 11.86 Earth years, and one day equals 9.92 Earth hours, how many Earth hours are there in a Jupiter year?"},
{"word": "Katherine Hepburn",
"description": "1909-2003, American actor and winner of four Academy Awards. She starred in such classics as The African Queen."},
{"word": "Keanu Reeves",
"description": "1964- , American actor of Bill And Ted's Excellent Adventure, The Matrix and Speed. Keanu means \"cool breeze over the mountains.\""},
{"word": "Killer Whales",
"description": "Black and white predatory whales. Boy, can they sing!"},
{"word": "Kilts",
"description": "If Mel Gibson can wear one, so can you."},
{"word": "King Arthur",
"description": "Legendary British king best known for Camelot and round tables."},
{"word": "King Henry VIII",
"description": "1491-1547, King of England, and founder of the Church of England. Six wives, no waiting."},
{"word": "Knock-Knock Jokes",
"description": "Who's there?"},
{"word": "Labor Unions",
"description": "Look for the Union label. And, while you're at it, look for Jimmy Hoffa ..."},
{"word": "Large Mouth Bass",
"description": "Oh, please, let it not sing ..."},
{"word": "Las Vegas",
"description": "The first casino opened in Las Vegas in 1946. Las Vegas ... or it that Lost Wages?\""},
{"word": "Lawyers",
"description": "We'd throw some joke in here, but we're afraid of getting sued."},
{"word": "Leaf Blowers",
"description": "Toro, Toro, Toro!"},
{"word": "Leather",
"description": "Animal hide. Leather you like it or not."},
{"word": "Leeches",
"description": "Any mention of lawyers, agents, or reporters would be FAR too easy ..."},
{"word": "Lemons",
"description": "When life gives you lemons, make lemonade ... or, in the case of a car, take it back. There's a law, you know!"},
{"word": "Lenin's Tomb",
"description": "We'd love to visit Lenin's Tomb, but it's probably just another communist plot."},
{"word": "Leonardo Da Vinci",
"description": "1452-1519, Florentine artist, sculptor, architect, engineer, scientist, and all-around smartypants."},
{"word": "Lightning",
"description": "Electrical discharge between rain clouds, or between a rain cloud and the earth, or between a rain cloud and an idiot with a kite."},
{"word": "Loan Sharks",
"description": "As dangerous as \"Jaws\", but without the charisma."},
{"word": "Lobster",
"description": "Crustaceans closely related to freshwater crayfishes. Market price."},
{"word": "Local Police",
"description": "They know who you are and they know where you live."},
{"word": "Log Cabins",
"description": "Among the many Americans born in log cabins were Preisdents Harrison, Lincoln, and Grant. Just pass the maple syrup."},
{"word": "Lollipops",
"description": "Sucker!"},
{"word": "London",
"description": "Founded even before the Romans reached England's shores, now the capital of Great Britain."},
{"word": "Looking For A Job",
"description": "Will work for fool ..."},
{"word": "Los Angeles",
"description": "LA LA Land."},
{"word": "Losing Your Job",
"description": "They just didn't understand me!"},
{"word": "Lucille Ball",
"description": "1911-89, American actor and comedian. You love Lucy? I love Lucy."},
{"word": "Machine Guns",
"description": "Automatic, rapid-fire, repeating weapons. The Gatling gun was used as early as the American Civil War."},
{"word": "Mad Cow Disease",
"description": "Degenerative brain disorder in cattle. The reason they don't know enough to come in out of the rain?"},
{"word": "Madame Curie",
"description": "1867-1934, French chemist and physicist who won a Nobel Prize for her work on radiation. Fun fact: A \"curie\" is a unit of radioactivity."},
{"word": "Madonna",
"description": "1958-, American singer, songwriter, actor, writer, and 1980s pop icon. Blond Ambition."},
{"word": "Magic Tricks",
"description": "\"Nothin' up my sleeve ...\" - Bullwinkle"},
{"word": "Mahatma Gandhi",
"description": "1869-1948, Indian leader and philosopher who preached nonviolence. Was assassinated for his efforts."},
{"word": "Manhattan",
"description": "I'll take Manhattan!."},
{"word": "Mardi Gras",
"description": "Fat Tuesday marks the final day before the Christian fast of Lent, a 40-day period of self-denial and abstinence. SO LET'S PARTY!"},
{"word": "Marilyn Monroe",
"description": "1926-62, American movie star, pinup and sex symbol. Just ask the Kennedys."},
{"word": "Mark Twain",
"description": "1835-1910, American writer and humorist, best known for the adventures of Tom Sawyer and Huckleberry Finn."},
{"word": "Marriage",
"description": "If love and marriage go together like a horse and carriage ... who's the horse?"},
{"word": "Mars",
"description": "The fourth planet from the sun. Where men come from."},
{"word": "Martha Stewart",
"description": "1941-, television personality, magazine editor, and author. Domestic arts are her stock-in-trade."},
{"word": "Martin Luther King, Jr.",
"description": "1929-68, American civil rights leader and advocate of nonviolent resistance. Was assassinated for his efforts."},
{"word": "Meat Cleavers",
"description": "No relation to Ward, June, or the Beaver ..."},
{"word": "Meatloaf",
"description": "Large and intimidating -the dish not the singer!"},
{"word": "Meg Ryan",
"description": "1961- , American actor and girl-next-door star of When Harry Met Sally, Sleepless In Seattle, and You've Got Mail."},
{"word": "Mel Gibson",
"description": "1956-, Australian actor. Known for The Road Warrior, Braveheart and :eatha; Weapon I, II, III, IV ..."},
{"word": "Men",
"description": "REAL Men."},
{"word": "Men In Black",
"description": "We're not here. You don't see us. The government did NOT send us."},
{"word": "Meryl Streep",
"description": "1959-, accomplished American actor, two-time Oscar winner, with over a dozen Academy Award nominations."},
{"word": "Mexico",
"description": "Federal republic in North America. The capital and largest city is Mexico City."},
{"word": "Mice",
"description": "\"The best-laid schemes o' mice an' men ...\" -Robert Burns"},
{"word": "Michael Jackson",
"description": "1958-, American popular singer, dancer, and songwriter. Welcome to Neverland."},
{"word": "Michael Jordon",
"description": "1963- , American professional basketball legend, led Chicago to six world championships. No bull."},
{"word": "Michelangelo",
"description": "1475-1564, inspired Italian sculptor, architect, painter, and poet. A REAL Renaissance man."},
{"word": "Michelle Pfeiffer",
"description": "1957-, American actor whose career began with Grease 2. She'd like us to forget that but remember her Oscar nominations."},
{"word": "Microsoft",
"description": "A leading American software company. We'd say more but we don't want to monopolize your time ..."},
{"word": "Midlife Crisis",
"description": "\"Here comes your 19th nervous breakdown ...\" -The Rolling Stone"},
{"word": "Mike Tyson",
"description": "1966- , American heavyweight boxer. Lend him your ear ..."},
{"word": "Miles Davis",
"description": "1926-91, innovative, influential, and respected American jazz trumpter player and band layer."},
{"word": "Milk",
"description": "Three glasses a day will give you ... the gratitude of the dairy industry."},
{"word": "Milk Duds",
"description": "Chocolate and caramel candy balls. Tooth extractions at no extra charge!"},
{"word": "Mirrors",
"description": "And now, a moment for reflection."},
{"word": "Mold",
"description": "Fuzzy growth produced on organic matter by several types of fungi. Particularly attracted to students' refrigerators"},
{"word": "Money",
"description": "\"The best things in life are free/ But you can give them to the birds and bees/ Just give me money ...\" -Bradford and Gordy"},
{"word": "Morticians",
"description": "Why do you hang around with THOSE stiffs ...?"},
{"word": "Mosquitoes",
"description": "They suck."},
{"word": "Motorcycles",
"description": "The air in your hair and bugs in your teeth."},
{"word": "Mount Rushmore",
"description": "Memorial carved into the side of the Black Hills in South Dakota. Heads above all other monuments."},
{"word": "MTV",
"description": "\"Video killed the radio star.\" -The Buggles"},
{"word": "Mud",
"description": "Water. Dirt. You do the math."},
{"word": "Mudslides",
"description": "Chocolate drink or natural disaster ... both occur frequently in California."},
{"word": "Muhammad Ali",
"description": "1942- , American heavyweight boxing champion. \"Floats like a butterfly, stings like a bee.\""},
{"word": "Musicals",
"description": "South Pacific, The King and I, The Sound of Music, A Chorus Line, Cats, Rent ..."},
{"word": "My 16th Birthday",
"description": "Dad, can I have the keys to the car, please?"},
{"word": "My Bank Account",
"description": "Speaking of theoretical mathematics and unreal numbers ..."},
{"word": "My Bathroom",
"description": "\"The bathroom was drenched with their splashings\" -Aldous Huxley"},
{"word": "My Bedroom",
"description": "\"No one knows what goes on behind closed doors.\" -Charlie Rich"},
{"word": "My Body",
"description": "Mine is a temple. Specifically, the Temple of Doom ..."},
{"word": "My Boss",
"description": "... is an idiot. You know it; we know it."},
{"word": "My Dreams",
"description": "\"What dreams may come ...\" -Shakespeare's Hamlet"},
{"word": "My Family",
"description": "They'll drive you nuts. As long as you do the same to them, it's all even."},
{"word": "My First Kiss",
"description": "Sparks were flying. Of course, that could have been the braces ..."},
{"word": "My Friends",
"description": "With friends like there, who needs enemies?"},
{"word": "My Future",
"description": "\"The future's so bright, I gotta wear shades ...\" -Timbuk-3"},
{"word": "My Hair",
"description": "Hair today, gone tomorrow ..."},
{"word": "My High School Prom",
"description": "As if adolescence isn't awkward and painful enough ..."},
{"word": "My Job",
"description": "Love it or leave it."},
{"word": "My Love Life",
"description": "\"All you need is love ...\" -The Beatles"},
{"word": "My Mind",
"description": "It's a terrible thing to waste."},
{"word": "My Neighborhood",
"description": "\"Please, won't you be my neighbor?\" -Fred Rogers"},
{"word": "My Past",
"description": "What's past is past ... unless you're a politician ..."},
{"word": "My Personality",
"description": "\"I'm good enough, smart enough and, gosh darn it, people like me.\" -Stewart Smalley played by Al Franken"},
{"word": "My Refrigerator",
"description": "It's a science experiment!"},
{"word": "Napoleon Bonaparte",
"description": "1769-1821, Emperor of France. Met his Waterloo at the Battle of Waterloo. The name should have tipped him off ..."},
{"word": "NASCAR",
"description": "Stock car racing began after World War II, breaking records for speed and for the number of advertisements on a single jacket."},
{"word": "Neil Simon",
"description": "1927-, American producer, playwright, and screenwriter of The Odd Couple, Biloxi Blues, The Sunshine Boys, California Suite, and many more."},
{"word": "New Orleans",
"description": "The Big Easy."},
{"word": "New Shoes",
"description": "Make you feel like dancing ..."},
{"word": "New York City",
"description": "America's most populous city. So good, they named it twice."},
{"word": "Niagara Falls",
"description": "Niagara Falls was formed about 12,000 years ago, when glaciers retreated north, and honeymooners approached from the south."},
{"word": "Nicholas Cage",
"description": "1964- , American actor known for his edgy characters in Leaving Los Vegas, Raising Arizona, and Moonstruck."},
{"word": "Ninjas",
"description": "Teenage mutant turtles need not apply."},
{"word": "Nobel Peace Prize",
"description": "Established by Alfred Nobel. Swedish industrialist and inventor of dynamite. Led to an explosion of peace efforts."},
{"word": "Noisy Neighbors",
"description": "WHAT? I CAN'T HEAR YOU!"},
{"word": "Normal Rockwell",
"description": "1894-1978, American painter, illustrator and all-around interpreter of small town American life."},
{"word": "Nuclear Power Plants",
"description": "\"You've turned a potential Chernobyl into a mere Three Mile Island.\" -Montgomery Burns, \"The Simpsons\""},
{"word": "NYPD",
"description": "The New York Police Department. They're so good, they have their own TV show."},
{"word": "Oil Spills",
"description": "The American oil tanker, Exxon Valdez, went aground in Prince William Sound, Alaska, Mar. 24, 1989. Slick Move."},
{"word": "Olive Oil",
"description": "Derived from fresh ripe fruit, which contain about 20% oil. Better than \"olive\" the other oils."},
{"word": "On-Line Shopping",
"description": "Enter your credit card number now. This is a secure site ... Sure it is ..."},
{"word": "Oprah Winfrey",
"description": "1954- , Television talk show host, actor and all-around American success story."},
{"word": "Oral Surgery",
"description": "You said a mouthful."},
{"word": "Oranges",
"description": "Face it ... nothing rhymes with orange."},
{"word": "Oxygen",
"description": "Oxygen was discovered in 1774. You'd think someone would have noticed it earlier."},
{"word": "Pablo Picasso",
"description": "1881-1973, Spanish painter and sculptor, one of the greatest artists of the 20th century. If only he could draw eyes ..."},
{"word": "Parenting",
"description": "The process of discovering you are becoming just like YOUR parents."},
{"word": "Paris, France",
"description": "The governmental, cultural and gastronomic capital of France. Or the world. Just ask the French."},
{"word": "Paying Bills",
"description": "Also known as \"Debt Restructuring.\""},
{"word": "Paying Taxes",
"description": "Death or Taxes? Do we have to choose right away?"},
{"word": "Penguins",
"description": "Flightless, aquatic birds that reside in the Southern Hemisphere. All dressed up and no place to go."},
{"word": "Picking Your Nose",
"description": "Noses run in our family."},
{"word": "Pigeons",
"description": "Birds with small heads, short necks, stout bodies, and an incredible attraction to statues."},
{"word": "Pigs",
"description": "Domesticated mammal of the swine family. Thaaa ... thaaa ... that's all, folks!"},
{"word": "Piranha",
"description": "Carnivorous fish found in rivers of South America. When you feel like a bite ..."},
{"word": "Pirates",
"description": "\"Yo, ho, yo, ho, a pirate's life for me ...\" - Pirates of the Caribbean"},
{"word": "Pit Bulls",
"description": "Any of several crossbreeds of bulldogs with terriers. Or, several radio hosts we could mention."},
{"word": "Plane Crashes",
"description": "Statistically safer than driving ... unless you crash."},
{"word": "Plastic",
"description": "Giant molecules of organic polymeric materials. Bags and bags of the stuff."},
{"word": "Playing Chess",
"description": "Has tantalized many of the world's greatest minds for almost 14 centuries. It just confuses the rest of us."},
{"word": "Poison Ivy",
"description": "Itching for a walk in the woods?"},
{"word": "Pokemon",
"description": "Cute cartoon monsters you gotta catch. What you do with them is up to you ..."},
{"word": "Pond Scum",
"description": "Simple organisms that carry out photosynthesis ... or spammers."},
{"word": "Poodles",
"description": "The only breed that is better groomed than their owners."},
{"word": "Popcorn",
"description": "Air poppers are for air heads ... I say bring on the butter!"},
{"word": "Porsche Boxster",
"description": "A two-seat, six cylander roadster - elegant design and superior drivability."},
{"word": "Postal Workers",
"description": "\"Neither snow, nor rain, nor heat, nor gloom of night, stays these couriers from the swift completion of their appointed rounds.\""},
{"word": "Power Tools",
"description": "\"More power! More power! Argh! Argh!\" -Tim, the Tool Man, Taylor, \"Home Improvement\""},
{"word": "Prince Charming",
"description": "The perfect man ... mythical, of course."},
{"word": "Princess Di",
"description": "1962-97, beloved English Princess who died in an auto crash. \"Good-bye England's Rose ...\" -Elton John"},
{"word": "Pro Wrestling",
"description": "They're just faking it. But then, so are we."},
{"word": "Psychiatrists",
"description": "\"And how do you feel about that?\""},
{"word": "Psychics",
"description": "The Psychic Friends Network went bankrupt in 1997. Perhaps they should have seen it coming ..."},
{"word": "Public Radio",
"description": "\"Good morning . . . . . This morning . . . . . . . . . . . .we have Wolfgang . . . Amadeus Mozart . . . for your listening pleasure . . .\""},
{"word": "Puff Daddy",
"description": "1971- , American rap artist. \"I'll be Missing You\" shot him to stardom; no pun intended."},
{"word": "Pulling Weeds",
"description": "It's either this or chemical warfare."},
{"word": "Pumping Iron",
"description": "When a great weight needs to be lifted."},
{"word": "Pushups",
"description": "Exercises, a type of bra, or the ice cream treat."},
{"word": "Pyramids",
"description": "Built by ancient civilizations, found mainly in Egypt, Guatemala, Honduras, Mexico and Peru. Probably the result of some pyramid scheme."},
{"word": "Quentin Terantino",
"description": "1963- , Groundbreaking American director and actor. Nice movies, but not nearly enough blood."},
{"word": "Quicksand",
"description": "Just don't let it get you down."},
{"word": "Ragweed",
"description": "A weed of the genus Ambrosia. Nothing to sneeze at."},
{"word": "Rain",
"description": "\"When the rain comes, they run and hide their heads; they might as well be dead.\" -The Beatles"},
{"word": "Rainbows",
"description": "\"Someday they'll find it/ The Rainbow Connection/ The lovers, the dreamers and me ...\" -Kermit the Frog"},
{"word": "Rappers",
"description": "PAENTAL ADVISORY EXPLICIT CONTENT Hasn't seemed to hurt sales..."},
{"word": "Reading A Good Book",
"description": "So many books, so little time."},
{"word": "Recreational Vehicles",
"description": "If they're trying to get away from it all, why are they taking it all with them?"},
{"word": "Recycling",
"description": "More than one million tons of aluminum are NOT recycled each year. Where do you throw your cans?"},
{"word": "Red Raspberries",
"description": "Worth a few scratches."},
{"word": "Rednecks",
"description": "\"You might be a redneck if ...\" -Jeff Foxworthy"},
{"word": "Redwood Forests",
"description": "\"From the Redwood Forests to the Gulf Stream Waters/ This land was made for you and me.\" -Woody Guthrie"},
{"word": "Reggae Music",
"description": "This contemporary Caribbean music, originating in Jamaica, remains an influential style of popular music. Ya mon!"},
{"word": "Regis Philbin",
"description": "1934- , American talk and game show host. Who wants to be a millionaire? Regis, apparently."},
{"word": "Remote Controls",
"description": "The world's handiest invention. That is, if you can find it."},
{"word": "Republicans",
"description": "A U.S. political party symbolized by an elephant ... and don't forget it!"},
{"word": "Richard Nixon",
"description": "1913-94, 37th President of the United States and the only president to have resigned from office. At least that's what the tapes say ..."},
{"word": "Robert DeNiro",
"description": "1943- , Pre-eminent American actor who earned Academy Awards for The Godfather II and Raging Bull. \"Are you looking at me?\""},
{"word": "Road Kill",
"description": "Mmmmmm. Them's good eatin'."},
{"word": "Road Trips",
"description": "\"Get Your Kicks on Route 66.\" -Nelson Riddle"},
{"word": "Robin Williams",
"description": "1952- , versatile American comedian and actor. The furriest man in show business."},
{"word": "Rock And Roll",
"description": "It's here to stay!"},
{"word": "Rock Concert",
"description": "If it's too loud - you're too old."},
{"word": "Rocket Scientists",
"description": "Hey! They're not rocket scie ... oh ... never mind."},
{"word": "Rocky Mountains",
"description": "These extend 2,000 miles from northeastern British Columbia to central New Mexico, and keep the Californians away from everyone else ..."},
{"word": "Rolling The Car",
"description": "You'll flip for this one ..."},
{"word": "Roman Numerals",
"description": "There's a I in VII chance you'll know them."},
{"word": "Romeo And Juliet",
"description": "William Shakespeare's best known play, written in 1595. Youthful love and hasty temperaments."},
{"word": "Root Beer Floats",
"description": "Actually, it's the ice cream that floats!"},
{"word": "Rosa Parks",
"description": "1913-, civil rights icon arrested in 1956 for violating U.S. segregation laws by refusing to give up her bus seat to a white passenger."},
{"word": "Rosie O'Donnell",
"description": "1962-, American actor and comedian. She's in a league of her own!"},
{"word": "Rubber Gloves",
"description": "Just in case ..."},
{"word": "Running A Marathon",
"description": "26 miles, 385 yards: the distance run by a Greek soldier from the town of Marathon to Athens in 490 BC."},
{"word": "Rush Limbaugh",
"description": "1951- , conservative talk-radio personality. Claims to host his radio show with half his brain tied behind his back, just to make it fair."},
{"word": "Russia",
"description": "The world's largest country, spanning 11 time zones. Famous for borscht, ballet, chess and vodka -just don't mix them."},
{"word": "Rust",
"description": "\"Rust never sleeps.\" -Neil Young"},
{"word": "Saddam Hussein",
"description": "1937-, dictator of Iraq 1979-2003."},
{"word": "Sailors",
"description": "\"In the Navy, you can sail the seven seas ...\" -The Village People"},
{"word": "Salads",
"description": "Lettuce not knock the vegetarians."},
{"word": "Salsa Dancing",
"description": "Popular form of Latin American dance. A little jazz, a little blues, a touch of rock and lots of heat."},
{"word": "Salvador Dali",
"description": "1904-89, Spansih artist best known for his dream imagery and surrealism, including the limp watches in The Persistence Of Memory."},
{"word": "Samuel L. Jackson",
"description": "1948-, powerful American actor of Pulp Fiction, Jackie Brown, and The Negotiator."},
{"word": "Saturday Cartoons",
"description": "Get your blanket, a bowl of cereal and snuggle in for three hours of commercials."},
{"word": "San Francisco",
"description": "California's City by the Bay. Where many hearts are left."},
{"word": "Saturn",
"description": "Sixth planet from the sun, and the second largest in the solar system. Has a nice ring to it, don't you think?"},
{"word": "Scavenger Hunt",
"description": "OK kids, here's your list: a marshmallow, a safety pin, a red rubber band, and a moon rock. Go find 'em!"},
{"word": "Scene Of The Crime",
"description": "It was Colonel Mustard, in the library, with the candlestick."},
{"word": "Schindler's List",
"description": "1993 Steven Spielberg film. Powerful real-life story of a Catholic businessman who eventually saved over 1000 Jews in Nazi Poland."},
{"word": "Science Fair Projects",
"description": "No human subjects, please!"},
{"word": "Science Fiction",
"description": "In a galaxy far, far away ..."},
{"word": "Screeching",
"description": "Please stop."},
{"word": "Sean Connery",
"description": "1930- , Accomplished Scottish actor, although best known as the REAL Bond, JAMES Bond ..."},
{"word": "Shania Twain",
"description": "1965- , Canadian country singer and songwriter. \"Shania\" means \"I'm on my way\" in Ojibwa."},
{"word": "Sharks",
"description": "Many species living today are similar to those from 100 million years ago. Because change is scary."},
{"word": "Shopping Mall",
"description": "Three-quarters of the North American population visit a shopping mall at least once a month."},
{"word": "Silk",
"description": "Produced as a cocoon covering by the silk worm, and used in fine fabrics and textiles."},
{"word": "Silly Putty",
"description": "It's putty in your hands!"},
{"word": "Skateboarding",
"description": "It's just going downhill ... down stairs ... down ramps ..."},
{"word": "Skiing",
"description": "The Super Giant Slalom: Swiss for \"suicide.\""},
{"word": "Skinheads",
"description": "Shaved heads, big boots. Some are Nazis, some are not."},
{"word": "Skunks",
"description": "Black and white striped mammals known for their offensive smelling defensive spray."},
{"word": "Skydiving",
"description": "Parachute canopies are usually made from nylon fabric that lasts for thousands of jumps - whether the skydiver does or not."},
{"word": "Sleeping Pills",
"description": "I remember taking them ... I just ... don't rememmer ... how mamy."},
{"word": "Slivers",
"description": "Also known as splinters. The worst ones are under your fingernails."},
{"word": "Sloppy Joes",
"description": "My favorite recipe -open the can."},
{"word": "Smithsonian Institution",
"description": "Located in Washington, D.C., the largest museum complex in the world. Wouldn't that be a great garage sale?"},
{"word": "Snakes",
"description": "Surprising, snakes move rapidly without legs. Also surprising, they find OTHER snakes attractive."},
{"word": "Snow",
"description": "Transparent ice crystals which form around dust and other small particles. Get my drift?"},
{"word": "Social Security",
"description": "American program designed to provide income and services in the event of retirement, sickness, disability, death or unemployment."},
{"word": "Socks",
"description": "\"Black socks, they never get dirty, the longer you wear them the stronger they get.\" -Bill Harley"},
{"word": "South Africa",
"description": "Two oceans, rugged mountains, traditional villages, game sanctuaries, wineries...forget the past and bring on the tourists."},
{"word": "South Park",
"description": "Highly-rated, highly offensive animated cartoon series. \"Oh my God! We killed Kenny!\""},
{"word": "Soy Sauce",
"description": "A brewed seasoning made from soybeans, wheat, and salt."},
{"word": "Spam",
"description": "Mystery meat, or mystery E-mails ..."},
{"word": "Speeding Tickets",
"description": "\"No, officer, I don't have any idea how fast I was going.\""},
{"word": "Spiders",
"description": "There are more than 34,000 species of spiders. Try not to think about THAT right before bedtime."},
{"word": "Spike Lee",
"description": "1957-, American film maker and Knicks fan. Best known for Do the Right Thing, Malcolm X, and 4 Little Girls."},
{"word": "Spilled Milk",
"description": "Got milk? WHOOPS! Apparently not ..."},
{"word": "Spit",
"description": "Ladies and gentlemen, straight from the Salivary Glands ..."},
{"word": "Spontaneous Combustion",
"description": "The ignition of substances without application of an external heat source. A good plot for \"The X-Files.\""},
{"word": "Sport Utility Vehicles",
"description": "Need new tires?"},
{"word": "Sports Channels",
"description": "Any team, any time."},
{"word": "Star Fruit",
"description": "Looks like plastic, tastes like lemons."},
{"word": "Starry Night",
"description": "A sky bright with stars, a classic Van Gogh painting, and a Don McLean song. Three cards in one!"},
{"word": "State Fair",
"description": "Aw, gee whiz, a blue ribbon for Bessie!"},
{"word": "Steak And Potatoes",
"description": "Hot off the grill!"},
{"word": "Stephen King",
"description": "1947- , American author of horror novels, who's sold more than 100 million copies of his books. Talk about frightening ..."},
{"word": "Steve Martin",
"description": "1945- , American comedian, actor, writer, and \"wild and crazy guy.\""},
{"word": "Steven Spielberg",
"description": "1947-, American movie director and producer, and overachiever. From E.T. to Schindler's List... too many to list."},
{"word": "Stonehenge",
"description": "Prehistoric stone monument located north of Salisbury, England."},
{"word": "Strawberry Shortcake",
"description": "Summertime and the eating is easy ..."},
{"word": "Stubbed Toes",
"description": "It'll feel better when it quits hurting."},
{"word": "Stunt People",
"description": "When you need someone to take the fall."},
{"word": "Summer Camp",
"description": "If the bugs don't get you, the poison ivy will!"},
{"word": "Sunday Drivers",
"description": "Now available ANY day of the week!"},
{"word": "Superman",
"description": "Fictional comic book superhero loved by Lois Lane and Jerry Seinfeld."},
{"word": "Supermodels",
"description": "Long legs = big bucks."},
{"word": "Surfing The Net",
"description": "www.otb-games.com"},
{"word": "Sushi",
"description": "Who would ever have guessed that raw fish could be so fashionable?"},
{"word": "Swiss Bank Accounts",
"description": "Do you think everyone in Switzerland has one?"},
{"word": "Swiss Chocolate",
"description": "\"What use are cartridges in battle? I always carry chocolate instead.\" -George Bernard Shaw"},
{"word": "Swiss Cheese",
"description": "Guess it comes from holey cows ..."},
{"word": "Taking A Bath",
"description": "Bathing facilities have been found in excavations in India from before 2000 BC. Soap-on-a-Rope hasn't."},
{"word": "Talk Radio",
"description": "Talk about air pollution."},
{"word": "Teachers",
"description": "If you can play this game, thank a teacher."},
{"word": "Telemarketers",
"description": "\"No, thank you ... No, I'm not interested ... No, I have to go now ...\""},
{"word": "Televangelists",
"description": "Not to be confused with Teletubbies."},
{"word": "Television",
"description": "One-hundred and sixty-four channels, and nothing worth watching."},
{"word": "Telling The Truth",
"description": "\"There are two kinds of truth. There are real truths and there are made-up truths.\" -Marion Barry, ex-mayor of Washington, D.C."},
{"word": "Terrorist Attack",
"description": "We will never negotiate with terrorists."},
{"word": "Thanksgiving Day",
"description": "The fourth Thursday of November in the U.S.; the second Monday in October in Canada."},
{"word": "The 1920s",
"description": "Pros: the Jazz Age. Cons: Presidents who look like librarians."},
{"word": "The 1950s",
"description": "Pros: Barbies, barbecues, and bikinis. Cons: McCarthy, the Korean War, television."},
{"word": "The 1960s",
"description": "Pros: the Moon Lsnding, the music. Cons: hippies who refuse to believe they're over."},
{"word": "The 1970s",
"description": "Pros ... uh ... pros ... uh ... GIVE US A MINUTE, OKAY?"},
{"word": "The 1980s",
"description": "Pros: meant the end of the 1970s. Cons: '80s nostalgia."},
{"word": "The 21st Century",
"description": "The future is NOW!"},
{"word": "The Academy Awards",
"description": "The statue known as \"Oscar\" weighs only eight and a half pounds. So why does it carry so much weight?"},
{"word": "The Beach",
"description": "A day at the beach is no day at the beach, ya know?"},
{"word": "The Beatles",
"description": "1960s British band. Only the most revolutionary, influential and universally acclaimed group of the 20th century. That's all."},
{"word": "The CIA",
"description": "The Central Intelligence Agency is responsible for keeping the U.S. government informed of foreign actions affecting the nation's interest."},
{"word": "The Cold War",
"description": "The post-World War II struggle between the US and its allies, and the former USSR and its allies. Things could have gotten hot."},
{"word": "The Common Loon",
"description": "A spotted, red-eyed diving bird -or various friends or family."},
{"word": "The Dallas Cowboys",
"description": "National Football League team known for their cheerleaders and their performance, both on and off the field."},
{"word": "The Dump",
"description": "Just remember to recycle."},
{"word": "The Eiffel Tower",
"description": "Designed and built by French engineer Alexandre Gustave Eiffel for the Paris World's Fair of 1889."},
{"word": "The Electric Chair",
"description": "In U.S. prisons, an alternating current of about 2000 volts is used for electrocution."},
{"word": "The End Of The World",
"description": "\"It's the end of the world as we know it, and I feel fine ...\" -REM"},
{"word": "The Everglades",
"description": "A vast marsh covering much of southern Florida. Watch out for alligators!"},
{"word": "The Far Left",
"description": "They get high Marx from some."},
{"word": "The Far Right",
"description": "Far right for some and far wrong for others."},
{"word": "The FBI",
"description": "The Federal Bureau of Investigation: the investigative agency for the U.S. Department of Justice. They're listening ..."},
{"word": "The First Day Of School",
"description": "\"Fear has many eyes.\" -Cervantes"},
{"word": "The French Riviera",
"description": "Holiday home of the rich, the famous, and the half-naked."},
{"word": "The Godfather",
"description": "The 1972 critically acclaimed Mafia movie that made us as offer we couldn't refuse."},
{"word": "The Grand Canyon",
"description": "217 miles long, 4 to 18 miles wide, and more than 1 mile deep. Now THAT'S grand."},
{"word": "The Grateful Dead",
"description": "American rock band, founded in 1965 and best known for their \"Dead Head\" fans."},
{"word": "The Great Chicago Fire",
"description": "The noteworthy fire of 1871 ... a hot time in the old town ..."},
{"word": "The Great Depression",
"description": "Prozac was invented six decades too late."},
{"word": "The Green Bay Packers",
"description": "Twelve time National Football League world champions, beloved by \"Cheeseheads\" everywhere. Are those brats done yet?"},
{"word": "The Gulf War",
"description": "January - February, 1991. This six week conflict with Iraq was also known as \"Desert Storm.\""},
{"word": "The Indy 500",
"description": "Contestants must drive the full 500 miles. Bathroom breaks ARE allowed."},
{"word": "The Internet",
"description": "Computer-based worldwide information network, and global shopping market."},
{"word": "The IRS",
"description": "The Internal Revenue Service: agency of the U.S. Department of the Treasury responsible for collecting taxes. A human audity."},
{"word": "The JFK Assassination",
"description": "November 22, 1963. The funeral of President Kennedy was watched on television by millions around the world."},
{"word": "The KKK",
"description": "If they're supposed to be the master race, why do they keep misspelling \"Clan\"?"},
{"word": "The Land Of Oz",
"description": "\"I've a feeling we're not in Kansas anymore, Toto.\" -Dorothy, \"The Wizard Of Oz\""},
{"word": "The Little Mermaid",
"description": "The 1837 story by Hans Christian Anderson or the 1989 animated film by Disney. Guess which made more money?"},
{"word": "The Mafia",
"description": "A loose association of criminal groups, bound by a blood oath and sworn to secrecy. Of course, now we have to kill you."},
{"word": "The Marx Brothers",
"description": "Chico, Groucho, Harpo, amd sometimes Zeppo. Their 1930s films include Duck Soup and Animal Crackers."},
{"word": "The Metric System",
"description": "No, thank you. We like our inches and feet!"},
{"word": "The Midwest",
"description": "America's central plains states. They're not like folks 'round here ..."},
{"word": "The Milky Way",
"description": "The galaxy that includes the sun, its solar system, and a chewy layer of caramel."},
{"word": "The Mississippi River",
"description": "The Algonquin words \"Misi sipi\" mean \"big river.\" What's Algonquin for \"muddy\"?"},
{"word": "The National Enquirer",
"description": "American tabloid newspaper. Inquiring minds want to know ... Why the heck does this thing sell?"},
{"word": "The New York Yankees",
"description": "Legendary American baseball team. With so much success, it's obvious why they're reviled."},
{"word": "The NRA",
"description": "National Rifle Association. They're gunning for your vote."},
{"word": "The Ocean",
"description": "How deep is the ocean? 12,000 feet. If they'd known that, maybe they wouldn't have written that stupid song."},
{"word": "The Old Man And The Sea",
"description": "Ernest Hemingway's classic novel - fishing, hunger, fishing, torment, fishing, personal loss ... fishing ..."},
{"word": "The Olympics",
"description": "An international athletic competition held every four years. The thrill of victors and the agony of defeat."},
{"word": "The Opera",
"description": "It ain't over 'til the fat lady sings. Unfortunately, sometimes, not even then."},
{"word": "The Ozone Layer",
"description": "Short for ozonosphere. Theories about the ozone layer are full of holes."},
{"word": "The Pentagon",
"description": "The five-sided home of the U.S. Department of Defense."},
{"word": "The Pyramids",
"description": "The Egyptian pyramids were built from about 2700 BC to about 1000 BC. Tut, tut, tut ..."},
{"word": "The Renaissance",
"description": "Beginning in the 1300s, started in Italy and spread across Europe. Kind of like Espresso bars ..."},
{"word": "The Rolling Stones",
"description": "British \"bad boy\" rock band formed in 1962. Still touring?"},
{"word": "The San Andreas Fault",
"description": "Geological feature in California stretching 600 miles. Like the state doesn't have enough faults already."},
{"word": "The South",
"description": "Dixie: South of the Mason-Dixon line, that is. They're not like folks 'round here ..."},
{"word": "The Statue Of Liberty",
"description": "\"Give me your tired, your poor/ Your huddled masses yearning to breathe free ...\" -Emma Lazarus"},
{"word": "The Super Bowl",
"description": "Who needs another national holiday?"},
{"word": "The Supreme Court",
"description": "The highest court in the United States. Robes, but no wigs."},
{"word": "The Three Tenors",
"description": "Opera stars Placido Domingo, Jose Carreras, and Luciano Pavarotti began recording as The Three Tenors in 1990."},
{"word": "The Titanic",
"description": "It sank in 1912. Get over it!"},
{"word": "The Universe",
"description": "Everything. The big \"It.\" Huge. Massive. THAT big."},
{"word": "The Vatican",
"description": "The Papal State in the middle of Rome. Home of the Pope, Swiss Guards, and lots of pigeons."},
{"word": "The Vietnam Memorial",
"description": "\"The Wall,\" built in 1982, was designed by 21-year-old architecture student, Maya Lin."},
{"word": "The Williams Sisters",
"description": "Venus, 1980-, and Serena, 1981-, Williams, American tennis champs. One heck of a sister act."},
{"word": "The Wright Brothers",
"description": "In 1903, Wilbur and Orville made the first powered airplane flights in history. Although there were delays at the airport."},
{"word": "The YMCA",
"description": "The Young Men's Christian Association has 30 million members in 110 countries. \"It's fun to stay at the Y-M-C-A.\" -The Village People"},
{"word": "Thomas Edison",
"description": "1847-1931, American inventor, developed a light bulb, generator, sound-recorder, and motion picture projector. Show off."},
{"word": "Thunder",
"description": "\"Here it comes again, Thunder and Lightning...\" -ELO."},
{"word": "Tibet",
"description": "Mountainous region of China and religious enclave for a form of Buddhism called Lamaism. Known as the roof of the world."},
{"word": "Ticks",
"description": "All ticks are bloodsucking parasites, but not all bloodsucking parasites are ticks."},
{"word": "Tidal Waves",
"description": "The gigantic ocean waves that strike with tremendous force, and cause considerable damage to life and property. Kind of like Spring Break."},
{"word": "Tiger Woods",
"description": "1975- , American star of the golf circuit. Known for his athletic skill, and youthful, classic style."},
{"word": "Toasted Marshmallows",
"description": "How do you like yours - golden brown or flaming?"},
{"word": "Toasters",
"description": "Wait -don't stick that fork in there!"},
{"word": "Tobacco Companies",
"description": "Who says tobacco's not addictive? THEY can't give it up ..."},
{"word": "Toes",
"description": "\"This little piggy went to market ...\""},
{"word": "Tom Cruise",
"description": "1962-, American actor. It looked like Ricky Business early on, but by 1986 he was Top Gun. No Mission Impossible for him."},
{"word": "Tom Hanks",
"description": "1956-, American actor and star of such varied films as Big, Philadelphia, Forrest Gump, Saving Private Ryan and Castaway."},
{"word": "Top Of A Rollercoaster",
"description": "Just remember: what goes UP ..."},
{"word": "Tornadoes",
"description": "Funnel-shaped cloud whirling destructively at speeds up to 300 mph. \"Honey, do you hear a freight train ... Honey?\""},
{"word": "Toys",
"description": "They're not just for kids, anymore ..."},
{"word": "Trailer Parks",
"description": "Also known as tornado magnets."},
{"word": "Trampolines",
"description": "Trampolines have been used in circuses wince the 18th century. Despite slumps in popularity, they always seem to bounce back!"},
{"word": "Tree Huggers",
"description": "\"Environmentalists\" to the left. \"Wackos\" to the right."},
{"word": "Truck Stops",
"description": "Breakfast 24 hours a day and you're on your way."},
{"word": "Tyrannosaurus Rex",
"description": "Large carnivorous dinosaur of the latter part of the Mesozoic era. My, what big teeth you have!"},
{"word": "Underwear",
"description": "\"Let's keep this brief.\""},
{"word": "United Nations",
"description": "The U.N. was founded in 1945, after World War II ended. Its mission is to maintain world peace. If we ever achieve it, that is ..."},
{"word": "Vacations",
"description": "\"Vacation, all I ever wanted, Vacation, had to get away ...\" -Go-Go's"},
{"word": "Vampires",
"description": "Legendary bloodsucking monsters."},
{"word": "Victorian England",
"description": "An era characterized by moral severity and pompous conservatism."},
{"word": "Video Games",
"description": "Just how DO you get to the thirteenth level of \"Doom\"?"},
{"word": "Vietnam, 1968",
"description": "More than 30,000 Americans had been killed in the Vietnam War by the end of 1968."},
{"word": "Vincent Van Gogh",
"description": "1853-90, Dutch post-impressionist painter known for dramatic sunflowers and self-portraits. Only one of his paintings sold during his lifetime."},
{"word": "Violins",
"description": "It's a pain in the neck, but keep practicing."},
{"word": "VW Beetles",
"description": "The prototype for the original VW Beetle was developed in 1934, and production begin in 1945. Functional, yet so fashionable."},
{"word": "Waco, Texas",
"description": "Texas city near where a 51-day standoff between law-enforcement officials and members of the Branch Davidians occurred in 1993."},
{"word": "Wall Street",
"description": "The financial center of the United States. See also: roller coaster."},
{"word": "Walt Disney",
"description": "1901-1966, the head of some Mickey Mouse company."},
{"word": "Warts",
"description": "Small, benign, circumscribed tumors of the outer layer of the skin. Warts and all!"},
{"word": "Watching Football",
"description": "Sheer athletic prowess by players in peak physical condition is a glorious thing to behold. Pass the chips and beer."},
{"word": "Water Parks",
"description": "You can go down Dead Man's Drop and I'll take the Lazy River."},
{"word": "Waterbeds",
"description": "Could serve as a safety precaution for those who smoke in bed."},
{"word": "Waterfalls",
"description": "\"Don't go chasing waterfalls...\" -TLC"},
{"word": "Watermelons",
"description": "Pardeeville, WI - home of the Watermelon Seed-Spitting & Speed-Eating Championship. The record is 2.5 lbs. of melon eaten in 3.5 seconds."},
{"word": "Weapons Dealers",
"description": "OK, what kind you need? Assault, Automatic, Atomic ...?"},
{"word": "Weddings",
"description": "\"Ding, dong, the bells are gonna chime ...\" -My Fair Lady"},
{"word": "Wheat",
"description": "Mainly used in flour. World output of wheat is more than 600 million metric tons a year ... so someone's making a lot of dough."},
{"word": "Wheel Of Fortune",
"description": "American TV game show, BIG MONEY! BIG MONEY!."},
{"word": "Whipped Cream",
"description": "Great on strawberry shortcake, banana splits, chocolate pudding ..."},
{"word": "Whips",
"description": "\"Crack that whip ... whip it, whip it good.\" -Devo"},
{"word": "Whoopie Goldberg",
"description": "1950-, American actor and comedian. Starred in such movies as Ghost, which earned her an Academy Award. Whoopee!"},
{"word": "Will Smith",
"description": "1968- , Successful American rap star, TV star and wildly successful motion picture star. He's got it all. We hate him."},
{"word": "William Shakespeare",
"description": "1564-1616, The English poet and playwright. And all the world IS a stage ..."},
{"word": "Wimbledon",
"description": "Strawberries ... cream ... temper tantrums ..."},
{"word": "Windsurfing",
"description": "Really just surfing for lazy people."},
{"word": "Wine Tasting",
"description": "Spit or swallow?"},
{"word": "Winning The Lottery",
"description": "The more you play, the more THEY win."},
{"word": "Witch Hunts",
"description": "Popular locations: Salem, Massachusetts and Washington, D.C."},
{"word": "Women",
"description": "REAL Women."},
{"word": "Women's Soccer",
"description": "The 1999 World Cup finals was the most-watched women's sporting event in history."},
{"word": "Wood Chippers",
"description": "\"I guess that was your accomplice in the wood chipper.\" -Marge Gunderson, Fargo"},
{"word": "Woodstock",
"description": "The 1969 love, music and mud festival attended by 400,000. Or, the little yellow bird."},
{"word": "Woody Allen",
"description": "1935- , American comedian, actor and director, of Bananas, Annie Hall, Hannah and Her Sisters, and lots of New York Stories."},
{"word": "Worms",
"description": "\"A man may fish with the worm that hath eat of a king, and eat of the fish that has fed of that worm.\" -\"Hamlet\" Shakespeare"},
{"word": "X-Ray Vision",
"description": "Available to Superman -for emergency use only."},
{"word": "X-Rays",
"description": "X-Rays were discovered in 1895 by the German physicist Wilhelm Conrad Roentgen. Now if they could just get those X-ray glasses down."},
{"word": "Yellowstone Park",
"description": "Home to 3000 geysers and hot springs. More gas and hot air than Washington, D.C."},
{"word": "Zen",
"description": "Japanese form of Buddhism, originated in China. Zen again, maybe not."},
{"word": "Zucchini",
"description": "A squashed vegetable."},
{"word": "A Cabin In The Woods",
"description": "Henry David Thoreau went to Walden Pond for two years. All we're asking for is one lousy weekend!"},
{"word": "A Can Of Worms",
"description": "Now you've opened it."},
{"word": "A Few Good Men",
"description": "Is that too much to ask?"},
{"word": "A Fool & His Money",
"description": "Are soon parted... especially on Wall Street."},
{"word": "A French Maid",
"description": "Ooh, la, la!"},
{"word": "A Hole In One",
"description": "Par for the course?"},
{"word": "A Little White Lie",
"description": "If you can't say anything nice . . ."},
{"word": "A Million Dollars",
"description": "If I had a million dollars. . ."},
{"word": "A Mummy",
"description": "\"Walk like an Egyptian.\" - The Bangles"},
{"word": "A Ringing In My Ears",
"description": "Answer that, would'ya?"},
{"word": "A Spare Tire",
"description": "The good news is: we have a spare tire . . ."},
{"word": "Abbot & Costello",
"description": "Comedy team who had everyone guessing - \"Who's on first?\""},
{"word": "Adam & Eve",
"description": "A relationship of Biblical proportions."},
{"word": "Alan Greenspan",
"description": "1926-, chairman of the U.S. Federal Reserve Board."},
{"word": "AM & FM",
"description": "Making waves in radio."},
{"word": "Amsterdam",
"description": "The capital of the Netherlands, and one of Europe's most beautiful and notorious cities."},
{"word": "Ancient Rome",
"description": "In ancient times, all roads led to Rome, and the traffic has only gotten worse."},
{"word": "Anna & The King",
"description": "The 1999 film romanticizing the story of Anna Leonowens and King Mongkut of Siam."},
{"word": "Anna Kournikova",
"description": "1981-, Russian-born star of the tennis court and internet."},
{"word": "Anthrax",
"description": "A potentially deadly infectious disease caused by spore bacteria. Anthrax has been developed as a biological weapon."},
{"word": "Antiques Roadshow",
"description": "PBS television program where folks bring oddities for appraisal. One person's trash is another's treasure."},
{"word": "Antony & Cleopatra",
"description": "Roman general and Egyptian queen. A love affair that wouldn't die. Oh, wait, it did."},
{"word": "Apples & Oranges",
"description": "Don't even TRY to compare them."},
{"word": "Aristotle",
"description": "384-322 B.C., ancient Greek philosopher. His writings formed the foundation for much of today's philosophical and political thought."},
{"word": "Arm & A Leg",
"description": "Sure, they were free, but just try replacing them."},
{"word": "Armadillo",
"description": "Burrowing mammal with armor-like bony plat covering. Roadkill extraordinaire."},
{"word": "Arnold Schwarzenegger",
"description": "1947-, Austrian born body-builder turned actor. \"My body is like breakfast, lunch, and dinner. I don't thinkabout it, I just have it.\""},
{"word": "Aroma Therapy",
"description": "Alternative medicine. Something's smelly about it."},
{"word": "Arsenic & Old Lace",
"description": "The hilarious dark comedy written by Joseph Kesselring, or the 1944 film adaptation by Frank Capra."},
{"word": "Assault & Battery",
"description": "That would be a single \"A\" battery."},
{"word": "Bagels And Lox",
"description": "A perfect snack for salmon-chanted evening ..."},
{"word": "Ball & Chain",
"description": "Don't let it get you down."},
{"word": "Ballroom Dancing",
"description": "Fox-trots, tangos, cha-chas, and more! Are you ready to rumba?"},
{"word": "Barbie & Ken",
"description": "Ah, to be blond and plastic..."},
{"word": "Baseball",
"description": "Its one, two, three strikes you're out . . ."},
{"word": "Batman & Robin",
"description": "Superheroes or vigilantes, you make the call."},
{"word": "Bats & Balls",
"description": "At least they don't go on strike."},
{"word": "BB Guns",
"description": "You'll shoot your eye out!\""},
{"word": "Beanbag Chairs",
"description": "For beanbag butts . . ."},
{"word": "Beauty & The Beast",
"description": "A French fairy tale, animated by Disney in 1991."},
{"word": "Beavis & Butt-Head",
"description": "He said \"butt.\" Huh-huh. Huh-huh."},
{"word": "Bed & Breakfast",
"description": "Not the same as breakfast in bed."},
{"word": "Beer & Pretzels",
"description": "\"These pretzels are making me thirsty\" - Cosmo Kramer, Seinfeld"},
{"word": "Being & Nothingness",
"description": "Jean Paul Satre's 1943 work based on the distinction between things that exist by themselves and those that exist for themselves."},
{"word": "Bells & Whistles",
"description": "It's got everything!"},
{"word": "Bert & Ernie",
"description": "Sesame Street's muppet buddies."},
{"word": "Big Bird",
"description": "Beloved Sesame Street character, or the not-necessarily-beloved U.S. spy satellite."},
{"word": "Bill & Ted",
"description": "Characters in Keanu Reeves' excellent time-travel adventure film. Yeah, dude."},
{"word": "Billy Crystal",
"description": "1947-, American comedian, actor and director. He looks maaaaah-velous."},
{"word": "Black Cats",
"description": "It's bad luck if they cross your path. You might step in a hairball!"},
{"word": "Black Licorice",
"description": "Alexander the Great and Julius Caesar both endorsed the beneficial properties of Licorice. No word on black jelly beans . . ."},
{"word": "Black Lingerie",
"description": "Victoria's REAL secret: selling skimpy negligees at hefty price . . ."},
{"word": "Blackouts",
"description": "They can occur at any"},
{"word": "Blood & Tears",
"description": "Don't forget the sweat."},
{"word": "Blue Velvet",
"description": "An elegant, textured fabric, Bobby Vinton love song, or David Lynch's bizarre 1986 film about the dark side of small-town America."},
{"word": "Boardwalk & Park Place",
"description": "Top of the line in the real estate game."},
{"word": "Body & Soul",
"description": "Just tryin' to keep it all together."},
{"word": "Body Snatchers",
"description": "We'd be worried, but nobody would want to snatch OUR bodies . . ."},
{"word": "Bodybuilders",
"description": "If you build it they will come."},
{"word": "Bonnie & Clyde",
"description": "American outlaws of the 1920s, played by Faye Dunaway and Warren Beatty in the 1967 film."},
{"word": "Bora Bora",
"description": "Volcanic island in the Pacific. Good oranges and vanilla."},
{"word": "Bow & Arrows",
"description": "More effective than sticks and stones."},
{"word": "Bowling",
"description": "Three strikes and you're in."},
{"word": "Bread & Water",
"description": "Make that a baguette and a bottle of Perrier."},
{"word": "Breaking & Entering",
"description": "\"Honest, Officer, I lost my keys.\""},
{"word": "Bride & Groom",
"description": "\"With this ring...\""},
{"word": "Brooks & Dunn",
"description": "Extremely successful country & honky-tonk music duo. \"If they don't dance, you're dead.\" - Ronnie Dunn"},
{"word": "Brothers & Sisters",
"description": "\"You can pick your friends, but...\""},
{"word": "Bulls & Bears",
"description": "On or off Wall Street."},
{"word": "Bumper Cars",
"description": "Much like rush hour in Chicago."},
{"word": "Burger & Fries",
"description": "You want flies with that?\""},
{"word": "Buttons & Bows",
"description": "Cute as a button, or a bow."},
{"word": "Calvin & Hobbs",
"description": "Bill Waterson's late, great comic strip featuring a little boy and his tiger."},
{"word": "Camelot",
"description": "\"On second though, let's not go to Camelot. 'Tis a silly place.\" - King Arthur, Monty Python and the Holy Grail"},
{"word": "Carlos Santana",
"description": "1947-, guitar legend and member of the Rock and Roll Hall of Fame. Truly Supernatural."},
{"word": "Carrot & A Stick",
"description": "The ultimate motivator... for a donkey."},
{"word": "Cat & Mouse",
"description": "It's just a game."},
{"word": "Catherine Zeta-Jones",
"description": "1969-, Welsh born actor, famous for her stunning good looks, as seen in The Mask Of Zorro, Entrapment and Traffic."},
{"word": "Cats & Dogs",
"description": "Is it raining?"},
{"word": "Catsup & Mustard",
"description": "The salsa revolution brought down their condiment empire."},
{"word": "Cauliflower",
"description": "Goes down easy when it's cheesy."},
{"word": "Caviar",
"description": "It's not JUST fish eggs. It's . . . fish eggs . . . that cost a fortune . . ."},
{"word": "Chain Link Fences",
"description": "Good fences make good neighbors."},
{"word": "Charles & Diana",
"description": "A right royal marriage."},
{"word": "Chat Rooms",
"description": "Electronic speakeasies for the information age."},
{"word": "Chips & Dip",
"description": "No double dipping!"},
{"word": "Chips & Salsa",
"description": "Nacho average snack!"},
{"word": "Chutes & Ladders",
"description": "A game of ups and downs."},
{"word": "Circus Peanuts",
"description": "Chewy, oragne marshmallow things shaped like peanuts. Seldom found at the circus."},
{"word": "Cleveland",
"description": "\"Cleveland rocks! Cleveland rocks!\" - The Drew Carey Show"},
{"word": "Cloned Sheep",
"description": "Dolly good show!"},
{"word": "Cockles & Mussels",
"description": "\"Alive--alive-o!\" I think I just lost my appetite."},
{"word": "Colin Powell",
"description": "1937-, U.S. Secretary of State and Chairman of the Join Chiefs of Staff during the Gulf War. We'd give him four stars."},
{"word": "Comic Books",
"description": "THIS looks like a job for . . . somebody who draws Superman!"},
{"word": "Convenience Stores",
"description": "\"Thank you come again.\""},
{"word": "Cops & Robbers",
"description": "When fighting crime was just child's play."},
{"word": "Corn Fields",
"description": "Knee high by the Fourth of July."},
{"word": "Corned Beef & Cabbage",
"description": "It's not chopped liver."},
{"word": "Corrugated Cardboard",
"description": "When you want to think out of the box . . ."},
{"word": "Cottage Cheese",
"description": "If it's so popular, where are all the Cottage Cheeseheads?"},
{"word": "Coughing & Sneezing",
"description": "And no cure in sight."},
{"word": "Cowboys",
"description": "Head 'em up and move 'em out!"},
{"word": "Cowboys & Indians",
"description": "How the west was won... and lost."},
{"word": "Crabs",
"description": "As crustaceans, crabs are related to lobster and shrimp. What do they all have in common? They all go well with butter."},
{"word": "Crash & Burn",
"description": "Try, try again."},
{"word": "Cream & Sugar",
"description": "Do you want some coffee with that?"},
{"word": "Crime & Punishment",
"description": "Fyodor Dostoevsky's 1917 classic novel following the tormented life of the murderer Rodion Romanovich Roskolnikov."},
{"word": "Cup & Saucer",
"description": "Tea Time!"},
{"word": "Curds & Whey",
"description": "What? It's just cottage cheese?"},
{"word": "Currier & Ives",
"description": "The lithography shop operated from 1834 to 1907 and produced over 7500 titles, all of which could have been called \"Life In America.\""},
{"word": "Cut & Curl",
"description": "You'll look mah-velous!"},
{"word": "D-Day, 1944",
"description": "On June 6, 1944 the Allied forces invaded France, employing over 10,000 airplanes, 5,000 ships, and 250,000 servicemen."},
{"word": "Dallas & Fort Worth",
"description": "The heart & soul of Texas."},
{"word": "David & Goliath",
"description": "Bible story featuring the future king David and the Philistine giant Goliath. The bigger they come, the harder they fall."},
{"word": "Day Care Centers",
"description": "Preschool for preschool."},
{"word": "Death & Dying",
"description": "The only way out."},
{"word": "Death & Taxes",
"description": "The two certainties in life."},
{"word": "Dinner & A Movie",
"description": "And a mortgage to pay for it."},
{"word": "Doctors & Dentists",
"description": "For a long life and healthy teeth."},
{"word": "Dodo Birds",
"description": "A large, flightless bird of the island of Mauritius. Discovered by Europeans in 1598, extinct by 1681."},
{"word": "Dog Days",
"description": "101 in the shade."},
{"word": "Doing The Hokey-Pokey",
"description": "That's what it's all about."},
{"word": "Dollars & Cents",
"description": "\"If it don't make dollars, it don't make sense.\" - DJ Quik"},
{"word": "Double Thick Malts",
"description": "For a double thick ice cream headache."},
{"word": "Dr. Evil",
"description": "Arch-nemesis of Austin Powers. Riiiiiiight."},
{"word": "Dr. Jekyll & Mr. Hyde",
"description": "Robert Louis Stevenson's 1887 novel revealing the hypocrisy and innate evilness in society. The idea came to him in a dream - a bad dream."},
{"word": "Dr. Laura",
"description": "1947-, American conservative talk show host and promoter of family values. HER family values, that is . . ."},
{"word": "Drew Barrymore",
"description": "1975-, heir to the Barrymore acting dynasty. Drew starred in ET, The Wedding Singer, Charlie's Angels, and countless tabloid stories."},
{"word": "Drew Carey",
"description": "1958-, American comedian and television star. Whose line is it anyway? His."},
{"word": "Drinking & Driving",
"description": "Friends don't let friends drive drunk."},
{"word": "Drunk Drivers",
"description": "Number one highway safety problem."},
{"word": "Dumb Blonde Jokes",
"description": "Are they just naturally funny?"},
{"word": "Dungeons & Dragons",
"description": "Popular role-playing game featuring swords, sorcery and wizards. Repeat after me: it's a game... it's only a game..."},
{"word": "Dustin Hoffman",
"description": "1937-, highly regarded actor of The Graduate, Midnight Cowboy, and Rainman. He's an excellent driver!"},
{"word": "Ebony & Ivory",
"description": "\"Ebony and ivory live together in perfect harmony.\" Paul McCartney"},
{"word": "Eggplant",
"description": "Without it there would be no Eggplant Parmesan."},
{"word": "Emergency Rooms",
"description": "Brings new meaning to he word \"heartthrob.\""},
{"word": "Exterminators",
"description": "Bugs, rats and vermin. It's time for chemical warfare."},
{"word": "Fairies",
"description": "Tiny, mischievous, mythical beings with magic powers. They live in Fairyland. Really."},
{"word": "Faith Hill",
"description": "1967-, American crossover country music artist. You just gotta have Faith."},
{"word": "Fame & Fortune",
"description": "Everybody may have 15 minutes of fame, but fortune is another thing altogether."},
{"word": "Fat",
"description": "I can't believe I ate the whooooooole thing."},
{"word": "Fear & Loathing",
"description": "In Las Vegas, or anywhere else."},
{"word": "Ferdinand & Isabella",
"description": "Late 15th century king and queen of Spain. They backed Christopher Columbus and benefitted royally."},
{"word": "Fertilizer",
"description": "Viagra for the garden."},
{"word": "Field & Stream",
"description": "The hunter's best friend."},
{"word": "Fish & Chips",
"description": "Just wrap it in any old newspaper."},
{"word": "Flannel Shirts",
"description": "Pick your plaid."},
{"word": "Flash Floods",
"description": "Too late for sandbags!"},
{"word": "Florence Nightengale",
"description": "1820-1910, English nurse and health-care reformer. We've been singing her praises for years."},
{"word": "Flowers & Candy",
"description": "When \"I'm sorry\" is not enough."},
{"word": "Folk Music",
"description": "When you're just fiddling around . . ."},
{"word": "Food & Shelter",
"description": "Gotta have it."},
{"word": "Food Poisoning",
"description": "This chicken tastes kinda funny . . ."},
{"word": "Foot & Mouth",
"description": "An infectious disease of animals with hooves. Not the same as foot-IN-mouth disease which affects everybody at one time or another."},
{"word": "Forever & Ever",
"description": "\"Oh, baby, I'm gonna to love you forever/ Forever and ever amen.\" Randy Travis"},
{"word": "Fortune Cookies",
"description": "\"You will soon eat a flat, dry, tasteless cookie . . .\""},
{"word": "Freaks & Geeks",
"description": "The 1999 television show, or those outside the social norm."},
{"word": "Fred & Ginger",
"description": "Fred Astair & Ginger Rogers - tap dancing their way into the hearts of millions."},
{"word": "Fred & Wilma",
"description": "Meet the Flintstones. \"Yabba-dabba-doooo!\""},
{"word": "Fred Flintstone",
"description": "Yaba-daba-dooooo!"},
{"word": "Friends & Family",
"description": "There when you need them."},
{"word": "Frisbees",
"description": "The frisbee was introduced to the market in 1948. Take one for a spin."},
{"word": "Frog & Toad",
"description": "Characters in a series of children's books by Arnold Lobel, or any of the millions of frogs and toads who choose not to wear clothes."},
{"word": "Gardening",
"description": "Get in touch with your roots."},
{"word": "George & Jane, His Wife",
"description": "The Jetsons television show first aired in 1962. In spite of our best efforts, cars still can't fly."},
{"word": "Gettysburg, 1863",
"description": "The turning point of the American Civil War, a bit more than four score and seven years ago."},
{"word": "Ghosts & Goblins",
"description": "\"I see dead people.\" - Cole Sear, The Sixth Sense"},
{"word": "Gilligan's Island",
"description": "Who would have thought that you could make a radio out of coconuts."},
{"word": "Ginger & Mary Ann",
"description": "\"Here on Gilligan's Isle.\""},
{"word": "Giraffes",
"description": "Giraffes can grow to 18 feet tall and have been known to kill a lion with a single kick. Not just another pretty face."},
{"word": "Go Karts",
"description": "Go kart, go!"},
{"word": "Going On A Cruise",
"description": "Iceberg, dead ahead!"},
{"word": "Gold & Silver",
"description": "There's a good reason Fort Knox is full of golg and not silver."},
{"word": "Good & Plenty",
"description": "The licorice candy was first produced in 1893, making it the oldest branded candy in the United States."},
{"word": "Goose & The Gander",
"description": "If it's good for the goose..."},
{"word": "Gourmet Coffee Shops",
"description": "I'll have a tall, double cappuccino, wet, with vanilla, half decaf, - to walk."},
{"word": "Grease",
"description": "Pretty slick!"},
{"word": "Grease & Grime",
"description": "What would Martha do?"},
{"word": "Haiku",
"description": "Traditional form of Japanese poetry consisting of three lines, usually containing a reference to nature."},
{"word": "Hammer & Nails",
"description": "\"If I had a hammer...\" - Peter, Paul and Mary"},
{"word": "Hammer & Sickle",
"description": "An emblem of the Communist movement, now retired... as is the Soviet Union."},
{"word": "Hang Gliding",
"description": "Trust us. It's a breeze."},
{"word": "Hansel & Gretel",
"description": "One of Grimm's grimmer fairy tales."},
{"word": "Hard Boiled Eggs",
"description": "Well, I'll be deviled . . ."},
{"word": "Harrison Ford",
"description": "1942-, Iconic American actor. \"Hokey religions and ancient weapons are no match for a blaster at your side, kid.\""},
{"word": "Harry Potter",
"description": "The hero in a series of books by J.K. Rowling featuring muggles and wizards."},
{"word": "Harvard & Yale",
"description": "\"What? Like it's hard?\" - Reese Witherspoon Legally Blond"},
{"word": "Hawks & Doves",
"description": "The big birds of war and peace."},
{"word": "Head Lice",
"description": "Head lice suck blood from the scalp and spread like crazy. A REAL parasite."},
{"word": "Heart & Soul",
"description": "They're yours. All yours!"},
{"word": "Heaven & Hell",
"description": "The ups and down of the afterlife."},
{"word": "Herb Gardens",
"description": "Rosemary, Basil, Chive . . . is it a herb garden or the cast from a British drama?"},
{"word": "Here & There",
"description": "And everywhere."},
{"word": "Hills & Valleys",
"description": "Nature's little ups and down."},
{"word": "Hip Hop",
"description": "Musical and cultural movement that gained popularity in the 1980s. Yo, yo, yo."},
{"word": "Hit & Run",
"description": "An automobile crash, or a baseball play."},
{"word": "Hollywood & Vine",
"description": "The Los Angeles street corner where dreams come true."},
{"word": "Hook & Ladder Trucks",
"description": "One big reason to become a firefighter."},
{"word": "Hootie & The Blowfish",
"description": "One of the most commercially successful pop bands to emerge in the 1990s. I go blind when I think about them."},
{"word": "Horse & Cart",
"description": "Get the order right!"},
{"word": "Hospital Gowns",
"description": "Open all hours."},
{"word": "Hotels & Motels",
"description": "Get a room!"},
{"word": "House & Home",
"description": "And money pit."},
{"word": "Howard Stern",
"description": "1954-, American shock disc jockey. His autobiography is titled Private Parts. If only they WERE private."},
{"word": "Husbands & Wives",
"description": "For richer... hopefully."},
{"word": "Ice & Snow",
"description": "\"We come from the land of the ice and snow/ From the midnight sun where the hot springs blow.\" - Led Zeppelin"},
{"word": "In The Doghouse",
"description": "All told, I'd rather be in the cathouse."},
{"word": "Irrational Fears",
"description": "What's that sound?"},
{"word": "Jenna & Barbara",
"description": "President Bush's daughters, the \"First Twins.\""},
{"word": "John Wayne",
"description": "1907-1979, legendary American actor, \"The Duke\" starred in such classics as Stagecoach, The Sands of Iwo Jima and True Grit."},
{"word": "Johnny Depp",
"description": "1963-, American actor and heart-throb. From Cry-Baby to Pirates of the Caribbean - he's as smooth as Chocolat."},
{"word": "Jonah & The Whale",
"description": "The greatest fish story ever told, in the Bible, that is."},
{"word": "Junkyard Dogs",
"description": "Not as mean as bad, bad Leroy Brown."},
{"word": "Jurassic Park",
"description": "1993 film based on Michael Chrichton's book about dinosaurs brought back to life, with Oscar-winning visual effects."},
{"word": "King Tut",
"description": "Boy king who ruled Egypt from 1333 to 1323 B.C., known for the great wealth of objects found in his tomb. He took it with him."},
{"word": "Kiss & Tell",
"description": "Best to keep your mouth shut."},
{"word": "Knife & Fork",
"description": "Knife on the right, fork on the left."},
{"word": "Knitting Needles",
"description": "Knit one, pearl two . . ."},
{"word": "Lady & The Tramp",
"description": "The 1955 Disney animated film featuring dogs, love and spaghetti."},
{"word": "Lance Armstrong",
"description": "1971-, American cyclist, cancer survivor and winner of the Tour De France - brought new meaning to the phrase \"Going Postal.\""},
{"word": "Lassie",
"description": "A famous collie, Lassie starred in her own TV show. What's that you say Lassie? Little Timmy's fallen down the well?"},
{"word": "Last Night",
"description": "About last night . . ."},
{"word": "Last Will & Testament",
"description": "It may be your only chance to get the last work on anything."},
{"word": "Laurel & Hardy",
"description": "Classic fat-skinny comedy duo of the 1920s."},
{"word": "Laverne & Shirley",
"description": "The 1970s sitcom phenomenon that defined Milwaukee for the world. And Milwaukee's still trying to live it down!"},
{"word": "Law & Order",
"description": "The television show, or the concept."},
{"word": "Leather & Lace",
"description": "It's a texture thing."},
{"word": "Lemon & Lime",
"description": "Pucker up."},
{"word": "Lemon Meringue Pie",
"description": "Tart, sweet and smooth."},
{"word": "Lethal Injection",
"description": "It's a killer."},
{"word": "Lewis & Clark",
"description": "The early 1800s expedition covered over 8000 miles and confirmed that the Louisiana Purchase was a very good deal."},
{"word": "Liberty & Justice",
"description": "For all."},
{"word": "Linguine With Clam Sauce",
"description": "Pass the parmesan . . ."},
{"word": "Lions & Tigers",
"description": "And bears..."},
{"word": "Liposuction",
"description": "Fatty tissue? That sucks . . ."},
{"word": "Liver And Onions",
"description": "An acquired taste."},
{"word": "Loch Ness Monster",
"description": "\"Nessie,\" the legendary beast of Loch Ness, Scotland. It must be real, they have pictures."},
{"word": "Lock & Key",
"description": "Quit picking on me!"},
{"word": "Lock & Load",
"description": "It's off to war we go."},
{"word": "Looney Tunes",
"description": "Warner Brothers cartoons featuring Porky Pig and Bugs Bunny."},
{"word": "Love & Marriage",
"description": "First comes love, then comes marriage..."},
{"word": "Lox & Bagels",
"description": "A deli favorite. Pass the cream cheese!"},
{"word": "Lucy & Desi",
"description": "Thirty years later and we still love Lucy."},
{"word": "M & M's",
"description": "Candy coated chocolates first sold in 1941. Now available in purple."},
{"word": "Macaroni & Cheese",
"description": "It's the easiest."},
{"word": "Mae West",
"description": "1892-1980, American stage and film comedian. \"Too much of a good thing can be wonderful.\""},
{"word": "Maggots",
"description": "I though it was rice."},
{"word": "Maple Syrup",
"description": "Made from the sweet sap of the maple tree or black maple tree, produced only in North America - a \"must have\" for pancakes."},
{"word": "Marlon Brando",
"description": "1924-2004, legendary American actor. Starred in A Streetcar Named Desire and won awards for On the Waterfront and The Godfather."},
{"word": "Matzo Balls",
"description": "Soul for the chicken soup."},
{"word": "Maui",
"description": "Hawaiian volcanic island, 728 square feet in area. Heaven on Earth."},
{"word": "Maximum Security Prison",
"description": "When a regular strength prison just won't do."},
{"word": "Me & My Shadow",
"description": "\"Strolling down the avenue...\""},
{"word": "Meat & Potatoes",
"description": "A simpler meal for a simpler time."},
{"word": "Meat Markets",
"description": "A cut above the rest."},
{"word": "Mensa High IQ Society",
"description": "Members have IQ's in the top 2% of the population."},
{"word": "Mickey & Minnie",
"description": "Mouse, that is. Disney's dynamic duo."},
{"word": "Migraine Headaches",
"description": "Not just any headache."},
{"word": "Milk & Cookies",
"description": "The ultimate after-school special."},
{"word": "Milwaukee",
"description": "They don't call their baseball team the \"Brewers\" for nuthin'."},
{"word": "Minneapolis & St. Paul",
"description": "The \"Twin Cities\" are Minnesota's largest population center. They may be twins but you can tell the difference."},
{"word": "Mom & Apple Pie",
"description": "Worth fighting for."},
{"word": "Mom & Pop",
"description": "Hey! Maybe they should open a store!"},
{"word": "Mom's Cooking",
"description": "Just like Mom USED to make."},
{"word": "Monitor & The Merrimac",
"description": "American Civil War ironclads, first fought each other in 1862."},
{"word": "Monkeys",
"description": "Monkeys see . . ."},
{"word": "Moon & The Stars",
"description": "You want what?"},
{"word": "Mount Vesuvius",
"description": "Italian volcano that rises above the Bay of Naples and blew its top in 79 A.D., much to Pompeii's regret."},
{"word": "Mutual Funds",
"description": "Mutually benefits you and your broker."},
{"word": "My Father",
"description": "\"Go ask your mother.\""},
{"word": "My Life",
"description": "\"There are places I'll remember/ All my life, though some have changed.\" The Beatles"},
{"word": "My Memories",
"description": "Thanks for the memories . . ."},
{"word": "My Mother",
"description": "\"Go ask your father.\""},
{"word": "NASA",
"description": "National Aeronautics and Space Administration, established in 1958 in part in response to the U.S.S.R. launching Sputnik."},
{"word": "Nashville",
"description": "Capital of Tennessee and capital of country music - also known as Nash Vegas."},
{"word": "New Yorkers",
"description": "Brash, brawny and full of bravado."},
{"word": "Nirvana",
"description": "A state of supreme spiritual bliss and liberation. And then there's the band . . ."},
{"word": "North & South Dakota",
"description": "It's all north."},
{"word": "Nosebleeds",
"description": "Keep your chin up."},
{"word": "*NSYNC",
"description": "Popular boy band known for their dance routines and harmonies. Bye, Bye, Bye our albums!"},
{"word": "Nuts & Bolts",
"description": "A good way to stay connected."},
{"word": "Odds & Ends",
"description": "It's in the junk drawer."},
{"word": "Oil & Filter",
"description": "Let me top that off for you."},
{"word": "Oil & Vinegar",
"description": "They don't mix, but we keep trying."},
{"word": "Old Age",
"description": "It looks good when you consider the alternative."},
{"word": "Ordinary People",
"description": "Nothing special."},
{"word": "Pail & Shovel",
"description": "I can dig it."},
{"word": "Panning For Gold",
"description": "The dot-coms of the 1840s . . ."},
{"word": "Paul McCartney & Wings",
"description": "Life after The Beatles."},
{"word": "Peace & Love",
"description": "Flower Power!"},
{"word": "Peace & Quiet",
"description": "Truly appreciated during parenthood."},
{"word": "Peaches & Cream",
"description": "A great complexion and a great dessert."},
{"word": "Peanut Butter & Jelly",
"description": "On white bread; cut off the crusts."},
{"word": "Peanuts & Popcorn",
"description": "It's a crackerjack combination!"},
{"word": "Pebbles & Bamm-Bamm",
"description": "The cartoon kids from The Flintstones. BAM-BAM, BAM-BAM, BAM-BAM."},
{"word": "Pencil & Paper",
"description": "We're drawn to them!"},
{"word": "Penn & Teller",
"description": "Magicians, illusionists, entertainers, and comedians."},
{"word": "Pez Dispensers",
"description": "Collectable candy dispensers first being sold in 1952. Believe it or not, there has never been an Elvis Pez dispenser."},
{"word": "Phone & Fax",
"description": "Soon you won't need to leave the house at all!"},
{"word": "Pineapple",
"description": "Tropical fruit, or the less lush hand grenade."},
{"word": "Pink Flamingos",
"description": "Gracing America's lawns for more than 40 years - sold only in pairs."},
{"word": "Pins & Needles",
"description": "It's all sewed up!"},
{"word": "Playing Golf",
"description": "For stress reduction. Now, get that head down and straighten your arm!"},
{"word": "Pole Vaulting",
"description": "The sport where you can reach new heights."},
{"word": "Pomp & Circumstance",
"description": "La-de-da."},
{"word": "Porcupines",
"description": "Quill-bearing rodents that can leave you in a prickly situation."},
{"word": "Pork & Beans",
"description": "Rustle us up some grub, Cookie."},
{"word": "Power & Glory",
"description": "The spoils of war."},
{"word": "President Bush",
"description": "1946-, 43rd president of the United States."},
{"word": "Pride & Prejudice",
"description": "Jane Austin's 1813 classic novel expounding on the consequences of pride."},
{"word": "Queen Elizabeth II",
"description": "1926-, Queen of the United Kingdom and Northern Ireland since 1952. Shame about the kids, though . . ."},
{"word": "R & B",
"description": "Rhythm and Blues."},
{"word": "R & D",
"description": "Research and Development."},
{"word": "R & R",
"description": "Rest and relaxation, recreation or could be recuperation."},
{"word": "Raves",
"description": "Neo-psychedelic all-night dance parties centered around acid, house, and techno music. All the rave."},
{"word": "Reading & Writing",
"description": "Old-fashioned skill, amazingly still useful today."},
{"word": "Regis & ...",
"description": "Kathy Lee or Kelly - your choice."},
{"word": "Rice & Beans",
"description": "The south-of-the-border meat and potatoes."},
{"word": "Rice Krispies Treats",
"description": "How could you go wrong with Rice Krispies, marshmallows, and butter."},
{"word": "Richard Simmons",
"description": "1948-, American fitness guru famous for his extroverted style, short shorts and Sweatin' to the Oldies."},
{"word": "Rio De Janeiro",
"description": "Vibrant Brazilian city and home to Carnival. Blame it on Rio!"},
{"word": "Road Rage",
"description": "Ten years ago we complained about potholes. NOW we're dodging pot-shots."},
{"word": "Robin Hood",
"description": "Legendary British outlaw who stole from the rich and gave to the poor, known for his courage, skill, and Merry Men."},
{"word": "Rock & Roll",
"description": "It'll never die. Unlike Rock and Roll musicians."},
{"word": "Rod & Reel",
"description": "He took it hook, line, and sinker."},
{"word": "Rogers & Hammerstein",
"description": "Kings of the Broadway Musical: The Sound of Music, The King and I, South Pacific, and many, many more."},
{"word": "Rope Burns",
"description": "You were playing WHAT?"},
{"word": "Rusty Nails",
"description": "Good name for a country western singer."},
{"word": "Salt 'N Pepa",
"description": "Extremely successful rap group formed in the 1980s, known for their portrayals of the woman's perspective on relationships."},
{"word": "Salt & Pepper",
"description": "\"Pump it up a notch! BAM!\" - Emeril Lagasse."},
{"word": "Sand & Surf",
"description": "Life's a beach!"},
{"word": "Sandra Bullock",
"description": "1964-, American actor who starred in Speed, Miss Congeniality, and While You Were Sleeping. The classic girl-next-door."},
{"word": "Scented Candles",
"description": "You didn't have to BAKE an apple pie - just light a candle."},
{"word": "Shake & Bake",
"description": "... and eat."},
{"word": "Shave & A Haircut",
"description": "Two bits."},
{"word": "Shipwrecks",
"description": "\"The lake it is said never gives up her dead . . .\" - The Wreck of the Edmund Fitzgerald\""},
{"word": "Sigmund Freud",
"description": "1856-1939, Viennese psychologist and the originator of psychoanalysis and the Freudian slip."},
{"word": "Sin & Redemption",
"description": "Everybody deserves a second chance."},
{"word": "Sitcoms",
"description": "If they're so funny, WHY THE LAUGH TRACK?"},
{"word": "Skin & Bones",
"description": "What would you be without them?"},
{"word": "Slash & Burn",
"description": "And there goes another rain forest..."},
{"word": "Slasher Films",
"description": "A real nightmare."},
{"word": "Slice & Dice",
"description": "A sharp knife is a safe knife."},
{"word": "Slip & Fall",
"description": "Watch out for ... too late!"},
{"word": "Slobodan Milosevic",
"description": "1941-, former leader of Serbia, also known as \"the Butcher of the Balkans.\""},
{"word": "Smith & Wesson",
"description": "Firearms when ready!"},
{"word": "Smoke & Mirrors",
"description": "That's how we do it!"},
{"word": "Snips & Snails",
"description": "And puppy dog tails."},
{"word": "Snoopy & The Red Barron",
"description": "Characters in the Peanuts comic strip. Talk about a dog fight!"},
{"word": "Space & Time",
"description": "Infinite."},
{"word": "Spiders & Snakes",
"description": "Creepy! Legs or no legs."},
{"word": "Spit & Polish",
"description": "We could do with less spit and more polish."},
{"word": "Stalactites & Stalagmites",
"description": "The ups and downs of spelunking."},
{"word": "Stamp Collecting",
"description": "If you can't lick 'em, collect 'em."},
{"word": "Stanley & Livingston",
"description": "Britons who explored Africa, I presume."},
{"word": "Stars & Stripes",
"description": "Three cheers for the red, white, and blue!"},
{"word": "Sticks & Stones",
"description": "When words are not enough."},
{"word": "Stocks & Bonds",
"description": "At least they're worth the paper they're printed on... We hope."},
{"word": "Stop Signs",
"description": "Gee, Officer, I THOUGHT it was green!"},
{"word": "Strained Peas",
"description": "The strain comes when you have to eat them."},
{"word": "Street Mimes",
"description": "A mime is a terrible thing to waste. On second thought . . ."},
{"word": "Stretch Limos",
"description": "Stretch your legs, stretch your wallet."},
{"word": "Strip Malls",
"description": "Almost as attractive as stip mines."},
{"word": "Sugar & Spice",
"description": "And everything nice."},
{"word": "Suit & Tie",
"description": "It's business as usual!"},
{"word": "Sumo Wrestlers",
"description": "Wrestlers usually weigh 300-400 pounds and win this Japanese form of wrestling by forcing an opponent out of the ring."},
{"word": "Surf & Turf",
"description": "Steak and lobster. No need to choose."},
{"word": "Surprise Parties",
"description": "SURPRISE! Oh. He had a heart condition . . . that WAS a surprise . . ."},
{"word": "Tarred & Feathered",
"description": "It's a sticky situation."},
{"word": "Tarzan & Jane",
"description": "He went ape over her."},
{"word": "Tattoo Parlors",
"description": "\"With nothing to show but this brand new tattoo . . . how I got it here I haven't a clue.\" - Jimmy Buffett"},
{"word": "Tea & Crumpets",
"description": "Upper-crust toast & jelly."},
{"word": "The 1990s",
"description": "Dot-coms, Clinton and designer coffee. The good old days."},
{"word": "The Atlantic & Pacific",
"description": "Oceans apart."},
{"word": "The Big Dipper",
"description": "Group of stars in the Northern sky that form part of the constellation Ursa Major."},
{"word": "The Birds & The Bees",
"description": "We'll tell you about them sometime."},
{"word": "The Chicken & The Egg",
"description": "Which came first? The egg. Look it up!"},
{"word": "The Dalai Lama",
"description": "Title of the leader of Tibetan Buddhism, in exile since 1959. Hello, Dalai!"},
{"word": "The Dixie Chicks",
"description": "Female country and western band with pop leanings. Winners of multiple Country Music Association awards. Goodbye, Earl!"},
{"word": "The Graveyard Shift",
"description": "It WILL be the death of me . . ."},
{"word": "The Great Barrier Reef",
"description": "Coral reefs, shoals and islets off the northern coast of Australia. Scuba heaven."},
{"word": "The Great Wall Of China",
"description": "A 1500 mile long wall across northern China. Built for fortification but better for tourism."},
{"word": "The Ice Age",
"description": "Polarity analysis of deep-sea sediment suggests the Pleistocene age began more than 1.8 million years ago. Bla-bla-bla."},
{"word": "The Judge",
"description": "Smile when you play this card."},
{"word": "The Mounties",
"description": "The Royal Canadian Mounted Police. They always get their man."},
{"word": "The North Pole",
"description": "Things can only go south from here . . ."},
{"word": "The Princess & The Pea",
"description": "The true test of a princess, fairy tale or otherwise."},
{"word": "The Scarlet Letter",
"description": "Hawthorne's 1845 novel about Puritan New England, moral conflicts, guilt, and down-right nastiness. (It was an \"A\".)"},
{"word": "The Symphony",
"description": "It's music to our ears."},
{"word": "The Three Stooges",
"description": "Nyuk, nyuk, nyuk. A wiseguy, eh?"},
{"word": "The U.S. Constitution",
"description": "We the people . . ."},
{"word": "The Young & The Restless",
"description": "Launched in 1973, this soap opera isn't young, but it's still restless."},
{"word": "Thelma & Louise",
"description": "1991 Ridley Scott film starring Susan Sarandon and Geena Davis as two over-the-edge women."},
{"word": "Three Men & A Baby",
"description": "The 1987 comedy film. You do the math."},
{"word": "Thunder & Lightning",
"description": "Nature's fireworks."},
{"word": "Timbuktu",
"description": "City of 20,000 located in the West African nation of Mali. The official name if Tombouctou. From here to Timbuktu."},
{"word": "Time Travel",
"description": "\"What do you mean I missed my connection in the 14th Century?\""},
{"word": "Timothy McVey",
"description": "1961-2001, the Oklahoma City Bomber."},
{"word": "Tom & Jerry",
"description": "A good chaser."},
{"word": "Tony Blair",
"description": "1951-, British Prime Minister, \"We will not rest until this evil is driven from our world.\" Sept. 11, 2001."},
{"word": "Track & Field",
"description": "It's eventful."},
{"word": "Tractors",
"description": "\"She thinks My Tractor's Sexy.\" - Kenny Chesney"},
{"word": "Treasure Hunting",
"description": "Gold Doubloons! Gold Doubloons! AT A YARD SALE?"},
{"word": "Trekkies",
"description": "Beam them up, PLEASE!"},
{"word": "Trinidad & Tobago",
"description": "Tiny, lush Caribbean republic. One of the most prosperous countries in the area due to petroleum and natural gas production."},
{"word": "Truth & Justice",
"description": "Sounds good on paper."},
{"word": "Turkey & Stuffing",
"description": "Get stuffed."},
{"word": "Tyra Banks",
"description": "1973-, American model, starred in Coyote Ugly. Probably the only time you'll see the words \"ugly\" and \"Tyra Banks\" in the same sentence."},
{"word": "Umbrella Drinks",
"description": "Extra fruit, please!"},
{"word": "Urban Sprawl",
"description": "Oh give me a home where the edge of town roams . . ."},
{"word": "Velcro",
"description": "A hook-and-loop fastener that can really grab you."},
{"word": "Venus & Mars",
"description": "As different as men & women."},
{"word": "Viagra",
"description": "It works for Bob Dole and 16 million others, it'll work for you."},
{"word": "Volcanoes",
"description": "Vents in the crust of the earth from which steam, debris and molten rock spew, with explosive results."},
{"word": "War & Peace",
"description": "Tolstoy's 1805 epic novel of the Napoleonic wars, a celebration of Russian spirit."},
{"word": "Washer & Dryer",
"description": "Take them out for a spin."},
{"word": "Waxing The Floor",
"description": "It's a pain in the neck, and back, and knees . . ."},
{"word": "Weed & Feed",
"description": "Make sure the grass is greener on YOUR side of the fence."},
{"word": "Weird Al Yankovic",
"description": "1959-, American musical humorist, born Alfred Matthew Yankovic, which is nothing to laugh about . . ."},
{"word": "Whips & Chains",
"description": "Popular before prison reform - the good old days."},
{"word": "White Collar Crime",
"description": "Three strikes and you're OUT . . . to a cozy little low-level detention facility with a pool and tennis court."},
{"word": "Will & Grace",
"description": "Popular sitcom debuted in 1998. Not your average next door neighbors."},
{"word": "Working Out",
"description": "No pain, no gain."},
{"word": "Xena, Warrior Princess",
"description": "Popular TV fantasy, adventure program. Xena, played by Lucy Lawless, and her friend Gabrielle, seek adventure and fight evil."},
{"word": "Yin & Yang",
"description": "Two elements that oppose each other and give life balance. If you're lucky."},
{"word": "Zippers",
"description": "Zip it, zip it good."},
{"word": "Zombies",
"description": "Undead ghouls that feed off of brains. So WE'RE safe . . ."}]